
 make.py started: 2018-05-14 17:13:58 C:\Users\giamb\Documents\GitHub\blowin_wind\analysis\event_study_plots\code 




Execute:  StataMP-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Stata15\ado\base/"
  [2]  (SITE)      "C:\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Stata15\ado\base/"
  [2]  (SITE)      "C:\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     local nbr_months 12
  2.     local nbr_years 6
  3. 
.     local input_file_list = "wind_panel_zip_median_listing_sqft " + ///
>                             "wind_panel_zip_zhvi"
  4.     local labels_list     = `""Log median listing price per sqft ($)" "' + ///
>                             `""Log ZHVI ($)""'
  5. 
.     forval col_index = 1/2 {
  6.         local inpt : word `col_index' of `input_file_list'
  7.         local lab_price : word `col_index' of `labels_list'
  8. 
.         use "${GoogleDrive}/stata/build_wind_panel/`inpt'.dta", clear
  9.         generate_reggroups, window(`nbr_months') time(dt) geo(regionname) stub(month)
 10.         *balance_panel, time(dt) geo(regionname) stub(month)
.         
.         label var relative_ev_month_reggroups ///
>             "Months relative to completion of first wind farm in ZIP code"
 11.         label var ln_p "`lab_price'"
 12.         
.         save_data "../temp/`inpt'_event_panel.dta", key(regionname dt) replace
 13.     }
 14. 
.     use "${GoogleDrive}/stata/build_wind_panel/wind_panel_tract_fhfa.dta", clear
 15.     generate_reggroups, window(`nbr_years') time(year) geo(tract_fip)
 16.     *balance_panel, time(year) geo(tract_fip)
. 
.     label var relative_ev_year_reggroups ///
>         "Years relative to completion of first wind farm in census tract"
 17.     label var ln_p "Log HPI"
 18. 
.     save_data "../temp/wind_panel_tract_fhfa_event_panel.dta", key(tract_fip year) replace
 19. 
.     foreach stub in "" "_hazard" "_notdetermined" "_nobuiltdate" {
 20.         use "${GoogleDrive}/stata/build_wind_panel/wind_panel_zip_fhfa`stub'.dta", clear 
 21.         generate_reggroups, window(`nbr_years') time(year) geo(regionname)
 22.         *balance_panel, time(year) geo(regionname)
.     
.         label var relative_ev_year_reggroups ///
>             "Years relative to completion of first wind farm in ZIP code"
 23.         label var ln_p "Log HPI"
 24. 
.         save_data "../temp/wind_panel_zip_fhfa_event_panel`stub'.dta", ///
>             key(regionname year) replace
 25.     }
 26. end

. 
. program generate_reggroups
  1.     syntax, window(int) time(str) geo(str) [stub(str)]
  2. 
.     if "`stub'" == "" {
  3.         local stub = "`time'"
  4.     }
  5. 
.     keep if !missing(wind_farm_event)
  6. 
.     gen relative_ev_`stub' = `time' - wind_farm_event
  7.     sort `geo' relative_ev_`stub'
  8.     gen relevant_time_period = (abs(relative_ev_`stub') <= `window')
  9.     egen relative_ev_`stub'_reggroups = group(relative_ev_`stub') if relevant_time_period
 10.     replace relative_ev_`stub'_reggroups = 0 if relative_ev_`stub' < -`window'
 11.     replace relative_ev_`stub'_reggroups = 1000 if relative_ev_`stub' > `window'
 12. end

. 
. program balance_panel
  1.     syntax, time(str) geo(str) [stub(str)]
  2. 
.     if "`stub'" == "" {
  3.         local stub = "`time'"
  4.     }
  5. 
.     bys `geo' (`time'): egen sum_reggroups = total(relative_ev_`stub'_reggroups) ///
>         if relevant_time_period
  6.     bys `geo' (`time'): carryforward sum_reggroups, replace
  7.     gsort `geo' -`time'
  8.     bys `geo': carryforward sum_reggroups, replace
  9. 
.     qui levelsof relative_ev_`stub'_reggroups ///
>         if relevant_time_period, local(levels) 
 10.     foreach l of local levels {
 11.         local i = `i' + `l'
 12.     }
 13.     keep if sum_reggroups == `i'
 14.     drop sum_reggroups
 15. end

. 
. * Execute
. main
(726,026 observations deleted)
(4707 missing values generated)
(993 real changes made)
(3,714 real changes made)
(data now sorted by regionname dt)
  variable relative_ev_month was float now int
  variable relevant_time_period was float now byte
  variable relative_ev_month_reggroups was float now int
  variable city was str27 now str20
  variable metro was str34 now str19
  variable county was str21 now str12
  (208,126 bytes saved)
==================================================================================================
File: ../temp/wind_panel_zip_median_listing_sqft_event_panel.dta
Key: regionname dt
==================================================================================================
  5477:26(104509):99937447:983116276

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |      5,477    69034.08    23971.76       1237      99337
          dt |      5,477    656.4254     27.2017        600        696
        date |          0
           p |      5,477    96.67076    48.05485   30.36232   434.7609
        city |          0
-------------+---------------------------------------------------------
   state_str |          0
       metro |          0
      county |          0
       state |      5,477    29.91839      15.078          4         51
        ln_p |      5,477    4.484545    .3935706   3.413202   6.074796
-------------+---------------------------------------------------------
new_turbin~h |      5,477    .3556692    2.679466          0         49
aggr_turb_~h |      5,477    46.72302    58.29257          0        331
        year |      5,477    2014.242    2.260918       2010       2018
   wind_farm |      5,477    .7560708    .4294897          0          1
wind_farm_~t |      5,477    616.1618     48.2176        525        695
-------------+---------------------------------------------------------
   zcta5ce10 |      5,477    69034.08    23971.76       1237      99337
       a_zip |      5,477    962.2585     1275.79   21.51904   8191.318
tot_wgt_wi~p |      5,477    498.3104    897.5325    .138322    6567.79
pot_wind_c~a |      5,477    47.17345    33.53379   .1531986   97.61828
new_turb_u~h |      5,477    280.5826    204.2626          0        898
-------------+---------------------------------------------------------
new_turb_r~h |      5,477    280.2269    204.1019          0        898
subvention~p |      5,477    13288.93    15251.27          0   87661.21
first_us_t~p |      5,477    47.17345    33.53379   .1531986   97.61828
relative_e~h |      5,477    40.26365    54.69995        -90        171
relevant_t~d |      5,477    .1405879    .3476277          0          1
-------------+---------------------------------------------------------
relative_e~s |      5,477    680.0215    464.4908          0       1000




(note: file ../temp/wind_panel_zip_median_listing_sqft_event_panel.dta not found)
file ../temp/wind_panel_zip_median_listing_sqft_event_panel.dta saved
(3,287,490 observations deleted)
(32571 missing values generated)
(20,853 real changes made)
(11,718 real changes made)
(data now sorted by regionname dt)
  variable relative_ev_month was float now int
  variable relevant_time_period was float now byte
  variable relative_ev_month_reggroups was float now int
  variable city was str30 now str20
  variable metro was str34 now str24
  variable county was str22 now str13
  (1,308,420 bytes saved)
==================================================================================================
File: ../temp/wind_panel_zip_zhvi_event_panel.dta
Key: regionname dt
==================================================================================================
  36345:26(104509):988677555:2593274499

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     36,345     59509.4    23845.74       1237      99337
          dt |     36,345    579.0331    75.49741        435        696
        date |          0
           p |     36,345    111187.8    66516.07      25300     852800
        city |          0
-------------+---------------------------------------------------------
   state_str |          0
       metro |          0
      county |          0
       state |     36,345    27.10442    13.99828          4         51
        ln_p |     36,345    11.50696    .4420976   10.13856   13.65628
-------------+---------------------------------------------------------
new_turbin~h |     36,345    .2690604    2.459007          0         86
aggr_turb_~h |     36,345    19.77282    41.58471          0        335
        year |     36,345    2007.792    6.294553       1996       2018
   wind_farm |     36,345    .3757876    .4843323          0          1
wind_farm_~t |     36,345    614.9456    45.31104        508        692
-------------+---------------------------------------------------------
   zcta5ce10 |     36,345     59509.4    23845.74       1237      99337
       a_zip |     36,345    634.1683    1018.874   21.51904   8191.318
tot_wgt_wi~p |     36,345    371.4765    742.2279          0    6567.79
pot_wind_c~a |     36,345    54.26031    34.01723          0   97.61828
new_turb_u~h |     36,345     176.723    201.1602          0        898
-------------+---------------------------------------------------------
new_turb_r~h |     36,345    176.4539    200.9036          0        898
subvention~p |     36,345    9870.643    14520.68          0   87661.21
first_us_t~p |     36,345    46.10601    37.05052          0   97.61828
relative_e~h |     36,345   -35.91251    87.91529       -257        188
relevant_t~d |     36,345    .1038382    .3050548          0          1
-------------+---------------------------------------------------------
relative_e~s |     36,345    323.7475    466.5044          0       1000




(note: file ../temp/wind_panel_zip_zhvi_event_panel.dta not found)
file ../temp/wind_panel_zip_zhvi_event_panel.dta saved
(1,201,872 observations deleted)
(2192 missing values generated)
(1,764 real changes made)
(428 real changes made)
(data now sorted by tract_fip year)
  variable relative_ev_year was float now byte
  variable relevant_time_period was float now byte
  variable relative_ev_year_reggroups was float now int
  (40,128 bytes saved)
==================================================================================================
File: ../temp/wind_panel_tract_fhfa_event_panel.dta
Key: tract_fip year
==================================================================================================
  5016:23(66034):3706196589:1174125257

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
   tract_fip |      5,016    2.86e+10    1.43e+10   4.00e+09   5.60e+10
        year |      5,016    2006.744    6.804217       1979       2017
  state_abbr |          0
annual_cha~e |      4,702    2.789392     7.43968     -42.58      65.04
         hpi |      5,016    142.2337    39.34612      60.74      463.1
-------------+---------------------------------------------------------
     hpi1990 |        444     151.383     54.1352      60.74     330.32
     hpi2000 |      3,282    114.3593    28.14615      38.28     271.49
       state |      5,016    25.07775    13.54306          4         51
        ln_p |      5,016    4.924572    .2491723   4.106603   6.137943
new_turbin~r |      5,016    3.691786    16.70269          0        202
-------------+---------------------------------------------------------
aggr_turb_~r |      5,016    25.78309    57.09035          0        570
   wind_farm |      5,016    .3628389    .4808669          0          1
wind_farm_~t |      5,016    2010.448     3.75693       2002       2017
  area_tract |      5,016    974.0359    1564.022     34.217   12584.16
tot_wgt_wi~t |      5,016    536.5238    996.6081          0   8554.535
-------------+---------------------------------------------------------
pot_wind_c~a |      5,016    58.58401    34.13335          0   98.16846
new_turb_u~r |      5,016    2134.915    1896.278          0       5829
new_turb_r~r |      5,016    2131.224    1893.149          0       5829
subvention~p |      5,016    127681.2    149766.8          0     572224
first_us_t~p |      5,016    50.61425    38.09119          0   98.16846
-------------+---------------------------------------------------------
relative_e~r |      5,016   -3.703748    7.595294        -31         15
relevant_t~d |      5,016    .5629984    .4960648          0          1
relative_e~s |      5,016    89.02911    278.2944          0       1000




(note: file ../temp/wind_panel_tract_fhfa_event_panel.dta not found)
file ../temp/wind_panel_tract_fhfa_event_panel.dta saved
(456,586 observations deleted)
(3019 missing values generated)
(2,613 real changes made)
(406 real changes made)
(data now sorted by regionname year)
  variable relative_ev_year was float now byte
  variable relevant_time_period was float now byte
  variable relative_ev_year_reggroups was float now int
  (46,560 bytes saved)
==================================================================================================
File: ../temp/wind_panel_zip_fhfa_event_panel.dta
Key: regionname year
==================================================================================================
  5820:23(36773):2666999510:2860242388

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |      5,820    62037.75    20259.23       1237      99361
        year |      5,820    2004.422    8.758702       1975       2017
AnnualChange |      5,470    2.901062    7.187023     -41.05      65.66
         hpi |      5,820    160.4795    82.71444       59.3    1512.02
HPIwith199~e |      1,759    152.2899    60.43006       20.6      491.1
-------------+---------------------------------------------------------
HPIwith200~e |      4,528    111.4799    33.04172      13.95     288.89
       state |      5,820    28.93969    14.58462          5         56
        ln_p |      5,820    5.008393      .33875   4.082609   7.321202
new_turbin~r |      5,820    2.421134    12.11281          0        235
aggr_turb_~r |      5,820    15.67457    36.46635          0        335
-------------+---------------------------------------------------------
   wind_farm |      5,820    .3042955     .460148          0          1
wind_farm_~t |      5,820    2010.722    3.768596       2002       2017
   zcta5ce10 |      5,820    62037.75    20259.23       1237      99361
       a_zip |      5,820    722.5833    1029.582   21.51904   8191.318
tot_wgt_wi~p |      5,820    447.6895    741.2064          0    6567.79
-------------+---------------------------------------------------------
pot_wind_c~a |      5,820    58.97314     32.9479          0   98.94295
new_turb_u~r |      5,820    1719.864    1785.354          0       5436
new_turb_r~r |      5,820    1717.443    1782.981          0       5436
subvention~p |      5,820    104210.7    135268.1          0   537853.9
first_us_t~p |      5,820    44.36488    38.71718          0   98.94295
-------------+---------------------------------------------------------
relative_e~r |      5,820   -6.300172    9.601983        -40         15
relevant_t~d |      5,820    .4812715    .4996921          0          1
relative_e~s |      5,820    72.89175    253.9366          0       1000




(note: file ../temp/wind_panel_zip_fhfa_event_panel.dta not found)
file ../temp/wind_panel_zip_fhfa_event_panel.dta saved
(450,361 observations deleted)
(492 missing values generated)
(472 real changes made)
(20 real changes made)
(data now sorted by regionname year)
  variable relative_ev_year was float now byte
  variable relevant_time_period was float now byte
  variable relative_ev_year_reggroups was float now int
  (8,104 bytes saved)
==================================================================================================
File: ../temp/wind_panel_zip_fhfa_event_panel_hazard.dta
Key: regionname year
==================================================================================================
  1013:26(77010):3654073934:1498759942

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |      1,013    59042.78    26528.86        757      99029
        year |      1,013      2004.7     9.47666       1977       2017
AnnualChange |        814    2.994238    7.342312      -24.9      44.16
         hpi |        864    173.1663    77.24828      65.52     591.69
HPIwith199~e |        361    155.4734    57.14919      52.28     325.89
-------------+---------------------------------------------------------
HPIwith200~e |        739    102.9835    31.38193      34.62     209.68
       state |        864    33.67245     11.7775          6         54
        ln_p |        864    5.078172    .3710046   4.182355   6.382983
new_turbin~r |        864           0           0          0          0
aggr_turb_~r |        864           0           0          0          0
-------------+---------------------------------------------------------
   zcta5ce10 |        864    57866.67    26626.02      13685      98568
       a_zip |        864    484.9731    783.3288   46.51623   4209.099
tot_wgt_wi~p |        864    233.9469    570.9583   .0200032   2622.665
pot_wind_c~a |        864    29.82921    30.60526   .0194073   91.98084
new_turb_u~r |        864    1574.356    1780.907          0       5436
-------------+---------------------------------------------------------
new_turb_r~r |        864    1574.356    1780.907          0       5436
subvention~p |        864    46352.61    89872.23          0   500007.9
first_us_t~p |        864    19.90596    28.51202          0   91.98084
max_turbin~p |        864           0           0          0          0
new_turb_z~d |      1,013     5.84304    18.75213          0        172
-------------+---------------------------------------------------------
aggr_turb_~d |      1,013    12.81244     28.7084          0        306
   wind_farm |      1,013    .3198421    .4666456          0          1
wind_farm_~t |      1,013     2011.92    2.584257       2006       2017
relative_e~r |      1,013   -7.220138    9.120943        -35         11
relevant_t~d |      1,013    .5143139    .5000419          0          1
-------------+---------------------------------------------------------
relative_e~s |      1,013    23.10464     138.764          0       1000




(note: file ../temp/wind_panel_zip_fhfa_event_panel_hazard.dta not found)
file ../temp/wind_panel_zip_fhfa_event_panel_hazard.dta saved
(450,489 observations deleted)
(482 missing values generated)
(479 real changes made)
(3 real changes made)
(data now sorted by regionname year)
  variable relative_ev_year was float now byte
  variable relevant_time_period was float now byte
  variable relative_ev_year_reggroups was float now int
  (7,720 bytes saved)
==================================================================================================
File: ../temp/wind_panel_zip_fhfa_event_panel_notdetermined.dta
Key: regionname year
==================================================================================================
  965:26(85512):1100956236:1416666388

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |        965    57143.55    23418.96      13367      99350
        year |        965    2006.928       9.093       1975       2018
AnnualChange |        708    2.647514    6.868366     -16.63      39.44
         hpi |        744    174.0362    128.7935      82.66    1194.45
HPIwith199~e |        215    136.4479    46.51099      23.47     280.29
-------------+---------------------------------------------------------
HPIwith200~e |        598    108.6036    32.68238      16.47      206.1
       state |        744    32.10887     13.1442          6         53
        ln_p |        744    5.042509    .4117919   4.414736   7.085441
new_turbin~r |        744           0           0          0          0
aggr_turb_~r |        744           0           0          0          0
-------------+---------------------------------------------------------
   zcta5ce10 |        744    53729.96       23953      13601      99350
       a_zip |        744    480.6154    386.7027    50.9243   1490.906
tot_wgt_wi~p |        744    191.0766    269.7933   .5404974   819.3995
pot_wind_c~a |        744     33.7711    34.48084   .1955155   93.35393
new_turb_u~r |        744    1701.429     1783.77          0       5436
-------------+---------------------------------------------------------
new_turb_r~r |        744    1701.429     1783.77          0       5436
subvention~p |        744     58321.5    107235.6          0   507471.9
first_us_t~p |        744    24.84055    33.93165          0   93.35393
max_turbin~p |        744           0           0          0          0
new_turb_z~d |        965    10.88705     27.7217          0        246
-------------+---------------------------------------------------------
aggr_turb_~d |        965    14.55959    34.52361          0        368
   wind_farm |        965    .2932642    .4554946          0          1
wind_farm_~t |        965    2015.437    2.321525       2010       2018
relative_e~r |        965   -8.508808    9.211393        -38          7
relevant_t~d |        965    .5005181     .500259          0          1
-------------+---------------------------------------------------------
relative_e~s |        965    6.075648    55.64163          0       1000




(note: file ../temp/wind_panel_zip_fhfa_event_panel_notdetermined.dta not found)
file ../temp/wind_panel_zip_fhfa_event_panel_notdetermined.dta saved
(446,641 observations deleted)
(3033 missing values generated)
(2,766 real changes made)
(267 real changes made)
(data now sorted by regionname year)
  variable relative_ev_year was float now byte
  variable relevant_time_period was float now byte
  variable relative_ev_year_reggroups was float now int
  (55,656 bytes saved)
==================================================================================================
File: ../temp/wind_panel_zip_fhfa_event_panel_nobuiltdate.dta
Key: regionname year
==================================================================================================
  6957:26(99909):2708586608:1783871163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |      6,957    59948.32    22293.79        603      99611
        year |      6,957    2006.193    8.822156       1975       2018
AnnualChange |      4,760    2.755685    6.834825     -31.85      56.73
         hpi |      5,039    163.7213    75.05136      65.52    1091.18
HPIwith199~e |      2,065    153.3668    55.40683      25.15     392.75
-------------+---------------------------------------------------------
HPIwith200~e |      4,147    105.2634    30.86111       22.2      248.5
       state |      5,039    31.22068    14.27402          3         56
        ln_p |      5,039    5.027116    .3535899   4.182355   6.995015
new_turbin~r |      5,039           0           0          0          0
aggr_turb_~r |      5,039           0           0          0          0
-------------+---------------------------------------------------------
   zcta5ce10 |      5,039    58684.58    22378.59       3440      99350
       a_zip |      5,039     611.199    846.4619   27.62108   4994.034
tot_wgt_wi~p |      5,039    290.8714    594.7941          0   4818.869
pot_wind_c~a |      5,039    41.71342    35.06513          0    96.6823
new_turb_u~r |      5,039    1623.878    1779.518          0       5436
-------------+---------------------------------------------------------
new_turb_r~r |      5,039    1623.878    1779.518          0       5436
subvention~p |      5,039    70644.58    115352.8          0   525564.9
first_us_t~p |      5,039    30.31461    35.69052          0    96.6823
max_turbin~p |      5,039           0           0          0          0
new_turb_z~e |      6,957    10.86603    28.53441          0        307
-------------+---------------------------------------------------------
aggr_turb_~e |      6,957    28.16904    64.81361          0        830
   wind_farm |      6,957    .4010349    .4901433          0          1
wind_farm_~t |      6,957    2011.964    3.255157       2000       2018
relative_e~r |      6,957   -5.771453    9.271236        -40         16
relevant_t~d |      6,957    .5640362    .4959181          0          1
-------------+---------------------------------------------------------
relative_e~s |      6,957     42.3066    191.3816          0       1000




(note: file ../temp/wind_panel_zip_fhfa_event_panel_nobuiltdate.dta not found)
file ../temp/wind_panel_zip_fhfa_event_panel_nobuiltdate.dta saved

. 
end of do-file


Execute:  StataMP-64 /e do "./figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 32-core Stata perpetual license:
       Serial number:  501506205566
         Licensed to:  KU Leuven FEB (CES)
                       KU Leuven

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./figures.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Stata15\ado\base/"
  [2]  (SITE)      "C:\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Stata15\ado\base/"
  [2]  (SITE)      "C:\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/mental_coupons/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Stata15\ado\base/"
  [2]  (SITE)      "C:\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/mental_coupons/ado"
  [9]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     local input_file_list = "wind_panel_zip_median_listing_sqft " + ///
>                             "wind_panel_zip_zhvi"
  2. 
.     foreach inpt in `input_file_list' {
  3.         use "../temp/`inpt'_event_panel.dta", clear
  4.         prepare_factor_info relative_ev_month if relevant_time_period
  5.         local reg_opts = r(reg_opts)
  6. 
.         make_event_study_plot, depvar(ln_p) time(dt) geo(regionname) ///
>             stub(month) saving(event_study_`inpt') `reg_opts'
  7.     }
  8. 
.     use "../temp/wind_panel_tract_fhfa_event_panel.dta", clear
  9.     prepare_factor_info relative_ev_year if relevant_time_period
 10.     local reg_opts = r(reg_opts)
 11. 
.     make_event_study_plot, depvar(ln_p) time(year) geo(tract_fip) ///
>         saving(event_study_wind_panel_tract_fhfa) `reg_opts'
 12. 
.     foreach stub in "" "_hazard" "_notdetermined" "_nobuiltdate" {
 13.         use "../temp/wind_panel_zip_fhfa_event_panel`stub'.dta", clear
 14.         prepare_factor_info relative_ev_year if relevant_time_period
 15.         local reg_opts = r(reg_opts)
 16. 
.         make_event_study_plot, depvar(ln_p) time(year) geo(regionname) ///
>             saving(event_study_wind_panel_zip_fhfa`stub') `reg_opts'
 17.     }
 18. end

. 
. program prepare_factor_info, rclass
  1.     syntax anything(name=factor_var) [if]
  2. 
.     qui levelsof `factor_var' `if', local(factor_levels)
  3.     local num_factor_levels: word count `factor_levels'
  4.     local median_factor_value = (`num_factor_levels' + 1)/2
  5.     local base_factor_value = `median_factor_value' - 1
  6.     return local reg_opts = "factor_levels(`factor_levels') " +             ///
>                             "num_factor_levels(`num_factor_levels') " +     ///
>                             "median_factor_value(`median_factor_value')" +  ///
>                             "base_factor_value(`base_factor_value')"
  7. end

. 
. program make_event_study_plot
  1.     syntax, depvar(str) time(str) geo(str) factor_levels(str) num_factor_levels(str) ///
>         median_factor_value(str) base_factor_value(str) saving(str) * [stub(str)]
  2. 
.     if "`stub'" == "" {
  3.         local stub = "`time'"
  4.     }
  5. 
.     areg `depvar' ib`base_factor_value'.relative_ev_`stub'_reggroups i.`time', ///
>         absorb(`geo') vce(robust)
  6. 
.     plot_event_study i(1/`num_factor_levels')bn.relative_ev_`stub'_reggroups, ///
>         label(`factor_levels') center xtitle(`: var label relative_ev_`stub'_reggroups') ///
>         ytitle(`: var label `depvar'') xlabel(minmax `median_factor_value', value)      ///
>         saving("../output/`saving'_`stub'.png") `options'
  7. end

. 
. * Execute
. main

Linear regression, absorbing indicators         Number of obs     =      5,477
                                                F( 122,   5272)   =      17.37
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9616
                                                Adj R-squared     =     0.9602
                                                Root MSE          =     0.0786

---------------------------------------------------------------------------------------------
                            |               Robust
                       ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
relative_ev_month_reggroups |
                         0  |   .0064029   .0127549     0.50   0.616    -.0186019    .0314077
                         1  |   .0066076   .0186064     0.36   0.723    -.0298686    .0430839
                         2  |  -.0094474   .0211619    -0.45   0.655    -.0509335    .0320386
                         3  |  -.0039062   .0225004    -0.17   0.862    -.0480163    .0402039
                         4  |  -.0054912   .0212101    -0.26   0.796    -.0470718    .0360893
                         5  |  -.0193882   .0210043    -0.92   0.356    -.0605653    .0217889
                         6  |  -.0050597    .020977    -0.24   0.809    -.0461833    .0360639
                         7  |  -.0041974   .0205297    -0.20   0.838    -.0444441    .0360494
                         8  |   .0077823   .0187656     0.41   0.678    -.0290061    .0445707
                         9  |  -.0090069   .0166677    -0.54   0.589    -.0416824    .0236687
                        10  |  -.0015218   .0175725    -0.09   0.931    -.0359711    .0329275
                        11  |  -.0014956   .0178414    -0.08   0.933    -.0364721     .033481
                        13  |   .0153605   .0183215     0.84   0.402    -.0205572    .0512781
                        14  |   .0130723   .0174122     0.75   0.453    -.0210628    .0472073
                        15  |   .0108839   .0196593     0.55   0.580    -.0276564    .0494242
                        16  |   .0088892   .0192382     0.46   0.644    -.0288256     .046604
                        17  |   .0182234   .0178181     1.02   0.306    -.0167075    .0531544
                        18  |   .0131859    .018648     0.71   0.480     -.023372    .0497437
                        19  |   .0038558    .017973     0.21   0.830    -.0313787    .0390904
                        20  |   .0015455    .019461     0.08   0.937    -.0366061    .0396971
                        21  |   .0048976   .0189038     0.26   0.796    -.0321617    .0419569
                        22  |  -.0059553   .0191323    -0.31   0.756    -.0434625     .031552
                        23  |  -.0000203   .0188464    -0.00   0.999     -.036967    .0369264
                        24  |  -.0122269   .0182477    -0.67   0.503    -.0479999    .0235462
                        25  |  -.0104091    .018372    -0.57   0.571    -.0464259    .0256076
                      1000  |  -.0383162   .0129431    -2.96   0.003      -.06369   -.0129423
                            |
                         dt |
                       601  |  -.0076456   .0324073    -0.24   0.814    -.0711772    .0558861
                       602  |   .0031047   .0313866     0.10   0.921    -.0584262    .0646355
                       603  |  -.0014411   .0305467    -0.05   0.962    -.0613253    .0584431
                       604  |   .0050097   .0287089     0.17   0.861    -.0512716    .0612911
                       605  |   .0003487   .0278833     0.01   0.990    -.0543142    .0550116
                       606  |  -.0068861   .0274476    -0.25   0.802    -.0606948    .0469226
                       607  |  -.0164802   .0272986    -0.60   0.546    -.0699967    .0370362
                       608  |  -.0132284    .027594    -0.48   0.632     -.067324    .0408673
                       609  |  -.0146237   .0273379    -0.53   0.593    -.0682173    .0389698
                       610  |  -.0149942   .0282759    -0.53   0.596    -.0704266    .0404383
                       611  |  -.0177136   .0280666    -0.63   0.528    -.0727358    .0373086
                       612  |  -.0323594   .0291844    -1.11   0.268    -.0895728     .024854
                       613  |  -.0277754   .0287702    -0.97   0.334     -.084177    .0286261
                       614  |  -.0316823   .0284103    -1.12   0.265    -.0873783    .0240137
                       615  |  -.0268223    .028197    -0.95   0.342    -.0821002    .0284555
                       616  |  -.0199376   .0277573    -0.72   0.473    -.0743533    .0344781
                       617  |  -.0142773     .02732    -0.52   0.601    -.0678359    .0392813
                       618  |  -.0162544   .0265069    -0.61   0.540    -.0682189    .0357101
                       619  |   -.024037   .0264942    -0.91   0.364    -.0759766    .0279026
                       620  |  -.0262813   .0264876    -0.99   0.321    -.0782079    .0256453
                       621  |     -.0274   .0269094    -1.02   0.309    -.0801536    .0253537
                       622  |  -.0294389   .0281711    -1.05   0.296    -.0846659    .0257881
                       623  |   -.050887   .0275639    -1.85   0.065    -.1049237    .0031497
                       624  |  -.0390706   .0275132    -1.42   0.156    -.0930079    .0148667
                       625  |  -.0393965   .0267468    -1.47   0.141    -.0918313    .0130383
                       626  |  -.0395606   .0267419    -1.48   0.139    -.0919858    .0128646
                       627  |   -.046757   .0262733    -1.78   0.075    -.0982634    .0047495
                       628  |   -.034202   .0262386    -1.30   0.192    -.0856404    .0172365
                       629  |  -.0395468   .0268436    -1.47   0.141    -.0921713    .0130777
                       630  |  -.0412086   .0273799    -1.51   0.132    -.0948846    .0124673
                       631  |   -.039671   .0261817    -1.52   0.130    -.0909979     .011656
                       632  |  -.0375338   .0267105    -1.41   0.160    -.0898975    .0148298
                       633  |   -.037918   .0272163    -1.39   0.164    -.0912732    .0154372
                       634  |  -.0058236   .0267002    -0.22   0.827     -.058167    .0465197
                       635  |    -.00388   .0266568    -0.15   0.884    -.0561384    .0483784
                       636  |   .0021589   .0263761     0.08   0.935    -.0495491    .0538668
                       637  |    .005716   .0265133     0.22   0.829     -.046261    .0576931
                       638  |   .0129341   .0256014     0.51   0.613    -.0372554    .0631235
                       639  |   .0164274   .0255042     0.64   0.520    -.0335714    .0664262
                       640  |   .0281302   .0255339     1.10   0.271    -.0219268    .0781873
                       641  |   .0353399    .025677     1.38   0.169    -.0149976    .0856774
                       642  |   .0380484   .0255103     1.49   0.136    -.0119624    .0880592
                       643  |   .0308906    .025207     1.23   0.220    -.0185256    .0803068
                       644  |   .0371335   .0255824     1.45   0.147    -.0130186    .0872855
                       645  |   .0389505   .0259393     1.50   0.133    -.0119012    .0898022
                       646  |   .0292587   .0256887     1.14   0.255    -.0211017    .0796191
                       647  |   .0346603   .0260238     1.33   0.183    -.0163572    .0856777
                       648  |   .0295679   .0258799     1.14   0.253    -.0211676    .0803033
                       649  |   .0393139   .0253582     1.55   0.121    -.0103985    .0890264
                       650  |   .0501007   .0256113     1.96   0.050     -.000108    .1003094
                       651  |   .0522028   .0255016     2.05   0.041     .0022091    .1021966
                       652  |   .0577161   .0251863     2.29   0.022     .0083405    .1070917
                       653  |   .0700007   .0251087     2.79   0.005     .0207772    .1192242
                       654  |   .0686205    .024965     2.75   0.006     .0196788    .1175621
                       655  |   .0647385    .024919     2.60   0.009     .0158868    .1135901
                       656  |   .0613897   .0245362     2.50   0.012     .0132886    .1094907
                       657  |   .0652984     .02466     2.65   0.008     .0169545    .1136422
                       658  |   .0560112   .0248756     2.25   0.024     .0072448    .1047776
                       659  |   .0586973   .0246145     2.38   0.017     .0104428    .1069519
                       660  |   .0563798   .0247132     2.28   0.023     .0079316    .1048279
                       661  |   .0682987   .0246843     2.77   0.006     .0199073    .1166901
                       662  |   .0750949   .0249097     3.01   0.003     .0262617    .1239282
                       663  |   .0904353   .0249766     3.62   0.000     .0414708    .1393999
                       664  |   .1029076   .0248403     4.14   0.000     .0542103    .1516049
                       665  |   .1085621   .0248981     4.36   0.000     .0597515    .1573726
                       666  |   .1040639    .024946     4.17   0.000     .0551595    .1529683
                       667  |    .113803   .0250782     4.54   0.000     .0646393    .1629668
                       668  |   .1072535   .0251317     4.27   0.000      .057985     .156522
                       669  |   .1074422   .0249524     4.31   0.000     .0585252    .1563593
                       670  |    .097292   .0249665     3.90   0.000     .0483474    .1462366
                       671  |   .0865115   .0250627     3.45   0.001     .0373783    .1356446
                       672  |   .0884607    .025117     3.52   0.000      .039221    .1377003
                       673  |   .0850493   .0254633     3.34   0.001     .0351307    .1349679
                       674  |   .0924301   .0253383     3.65   0.000     .0427565    .1421036
                       675  |   .1047747   .0248168     4.22   0.000     .0561235    .1534259
                       676  |   .1123585   .0246854     4.55   0.000     .0639649    .1607521
                       677  |   .1234538   .0247779     4.98   0.000     .0748789    .1720286
                       678  |   .1267958    .024766     5.12   0.000     .0782443    .1753473
                       679  |   .1318674   .0251549     5.24   0.000     .0825534    .1811814
                       680  |   .1267087   .0249212     5.08   0.000     .0778529    .1755646
                       681  |   .1247811    .025109     4.97   0.000      .075557    .1740051
                       682  |   .1174726   .0251456     4.67   0.000     .0681768    .1667683
                       683  |   .1065886   .0252857     4.22   0.000     .0570182     .156159
                       684  |   .1041639   .0258216     4.03   0.000     .0535428    .1547849
                       685  |   .1139771   .0254193     4.48   0.000     .0641448    .1638095
                       686  |   .1243453   .0253338     4.91   0.000     .0746807      .17401
                       687  |    .136517   .0251944     5.42   0.000     .0871255    .1859085
                       688  |   .1471223   .0252174     5.83   0.000     .0976856    .1965589
                       689  |   .1490272   .0254489     5.86   0.000     .0991367    .1989176
                       690  |   .1476874   .0255858     5.77   0.000     .0975287    .1978461
                       691  |   .1475574    .025467     5.79   0.000     .0976315    .1974834
                       692  |   .1552236   .0255467     6.08   0.000     .1051414    .2053058
                       693  |   .1500339   .0257796     5.82   0.000     .0994952    .2005725
                       694  |   .1542883   .0259465     5.95   0.000     .1034225    .2051542
                       695  |   .1515767   .0259766     5.84   0.000     .1006517    .2025017
                       696  |   .1532965   .0262037     5.85   0.000     .1019263    .2046667
                            |
                      _cons |   4.444382   .0264674   167.92   0.000     4.392495    4.496269
----------------------------+----------------------------------------------------------------
                 regionname |   absorbed                                      (83 categories)
(note: file ../output/event_study_wind_panel_zip_median_listing_sqft_month.png not found)
(file ../output/event_study_wind_panel_zip_median_listing_sqft_month.png written in PNG format)

Linear regression, absorbing indicators         Number of obs     =     36,345
                                                F( 287,  35882)   =      87.16
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9117
                                                Adj R-squared     =     0.9105
                                                Root MSE          =     0.1322

---------------------------------------------------------------------------------------------
                            |               Robust
                       ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
relative_ev_month_reggroups |
                         0  |  -.0377511   .0102198    -3.69   0.000    -.0577822     -.01772
                         1  |  -.0062365   .0142593    -0.44   0.662    -.0341851     .021712
                         2  |  -.0043822   .0142536    -0.31   0.759    -.0323196    .0235553
                         3  |  -.0034097   .0142073    -0.24   0.810    -.0312564     .024437
                         4  |  -.0027029   .0141849    -0.19   0.849    -.0305056    .0250999
                         5  |  -.0022813   .0141858    -0.16   0.872    -.0300859    .0255233
                         6  |  -.0017139   .0141956    -0.12   0.904    -.0295377    .0261099
                         7  |  -.0013251   .0141683    -0.09   0.925    -.0290953    .0264452
                         8  |  -.0005878   .0141809    -0.04   0.967    -.0283828    .0272072
                         9  |   .0008334    .014219     0.06   0.953    -.0270362     .028703
                        10  |   .0003347   .0142106     0.02   0.981    -.0275185    .0281878
                        11  |  -.0000134   .0141951    -0.00   0.999    -.0278362    .0278093
                        13  |   .0001975   .0141247     0.01   0.989    -.0274873    .0278824
                        14  |   .0000408   .0141106     0.00   0.998    -.0276165    .0276981
                        15  |  -.0001854   .0141138    -0.01   0.990    -.0278489    .0274781
                        16  |  -.0002607   .0140827    -0.02   0.985    -.0278633     .027342
                        17  |  -.0003028   .0140935    -0.02   0.983    -.0279265     .027321
                        18  |  -.0000804   .0141534    -0.01   0.995    -.0278215    .0276608
                        19  |   .0004496    .014224     0.03   0.975    -.0274298     .028329
                        20  |  -.0016088   .0142608    -0.11   0.910    -.0295604    .0263427
                        21  |  -.0000595   .0141346    -0.00   0.997    -.0277638    .0276448
                        22  |    .001673   .0140738     0.12   0.905    -.0259121     .029258
                        23  |   .0016149   .0141235     0.11   0.909    -.0260675    .0292974
                        24  |    .001783   .0142359     0.13   0.900    -.0261198    .0296858
                        25  |   .0018071   .0142329     0.13   0.899    -.0260898    .0297039
                      1000  |   .0062176   .0102019     0.61   0.542    -.0137785    .0262136
                            |
                         dt |
                       436  |   .0015166   .0347542     0.04   0.965    -.0666028    .0696359
                       437  |   .0018546   .0345792     0.05   0.957    -.0659217     .069631
                       438  |   .0029879   .0344833     0.09   0.931    -.0646004    .0705761
                       439  |   .0058286   .0344001     0.17   0.865    -.0615965    .0732538
                       440  |   .0077922   .0343304     0.23   0.820    -.0594964    .0750809
                       441  |   .0085387   .0343503     0.25   0.804     -.058789    .0758665
                       442  |   .0101182   .0344249     0.29   0.769    -.0573556     .077592
                       443  |   .0133957   .0344457     0.39   0.697    -.0541188    .0809103
                       444  |    .017921   .0343895     0.52   0.602    -.0494834    .0853254
                       445  |   .0231234   .0330795     0.70   0.485    -.0417135    .0879602
                       446  |   .0260215   .0329136     0.79   0.429    -.0384901    .0905331
                       447  |    .027444    .032812     0.84   0.403    -.0368685    .0917565
                       448  |   .0292058   .0328059     0.89   0.373    -.0350948    .0935064
                       449  |   .0322476   .0328146     0.98   0.326      -.03207    .0965653
                       450  |   .0345708   .0327955     1.05   0.292    -.0297094    .0988509
                       451  |   .0291325   .0320465     0.91   0.363    -.0336796    .0919446
                       452  |   .0303852   .0319821     0.95   0.342    -.0323008    .0930711
                       453  |   .0328333   .0318764     1.03   0.303    -.0296454     .095312
                       454  |   .0347582   .0317543     1.09   0.274    -.0274812    .0969977
                       455  |   .0356407   .0315966     1.13   0.259    -.0262896    .0975711
                       456  |   .0361129   .0314266     1.15   0.251    -.0254842    .0977099
                       457  |   .0397986   .0310041     1.28   0.199    -.0209704    .1005677
                       458  |   .0427342   .0309217     1.38   0.167    -.0178732    .1033416
                       459  |   .0422903   .0307575     1.37   0.169    -.0179953     .102576
                       460  |   .0447271   .0307293     1.46   0.146    -.0155034    .1049575
                       461  |   .0474404   .0306535     1.55   0.122    -.0126415    .1075223
                       462  |   .0517464   .0305298     1.69   0.090    -.0080931    .1115858
                       463  |   .0575649   .0303124     1.90   0.058    -.0018482     .116978
                       464  |   .0619652   .0302033     2.05   0.040     .0027658    .1211647
                       465  |   .0668905   .0300619     2.23   0.026     .0079682    .1258127
                       466  |   .0733833   .0299378     2.45   0.014     .0147042    .1320623
                       467  |   .0785554   .0298388     2.63   0.008     .0200704    .1370404
                       468  |   .0816763   .0297855     2.74   0.006     .0232959    .1400567
                       469  |   .0861349   .0296973     2.90   0.004     .0279274    .1443424
                       470  |   .0926792   .0295388     3.14   0.002     .0347823    .1505761
                       471  |   .0984549   .0293325     3.36   0.001     .0409624    .1559475
                       472  |   .1031531   .0292066     3.53   0.000     .0459073    .1603989
                       473  |   .1086456   .0291155     3.73   0.000     .0515783    .1657128
                       474  |   .1132459   .0290115     3.90   0.000     .0563824    .1701093
                       475  |   .1158961   .0289241     4.01   0.000      .059204    .1725881
                       476  |   .1182482   .0289111     4.09   0.000     .0615815    .1749149
                       477  |    .121232   .0289062     4.19   0.000     .0645749    .1778891
                       478  |   .1234981   .0288753     4.28   0.000     .0669017    .1800946
                       479  |   .1251749   .0287922     4.35   0.000     .0687414    .1816085
                       480  |   .1260955   .0286872     4.40   0.000     .0698678    .1823232
                       481  |   .1280822   .0285829     4.48   0.000     .0720588    .1841057
                       482  |   .1318857   .0284803     4.63   0.000     .0760634     .187708
                       483  |   .1370961   .0284052     4.83   0.000     .0814211     .192771
                       484  |   .1419267   .0283361     5.01   0.000     .0863872    .1974662
                       485  |   .1445584   .0282329     5.12   0.000     .0892211    .1998957
                       486  |   .1460425   .0281073     5.20   0.000     .0909513    .2011337
                       487  |   .1483861   .0279754     5.30   0.000     .0935534    .2032187
                       488  |   .1514339   .0278192     5.44   0.000     .0969074    .2059605
                       489  |   .1555723    .027641     5.63   0.000     .1013951    .2097494
                       490  |   .1603687   .0275075     5.83   0.000     .1064532    .2142843
                       491  |   .1654934   .0274365     6.03   0.000      .111717    .2192697
                       492  |   .1705558    .027401     6.22   0.000      .116849    .2242626
                       493  |   .1759931   .0273987     6.42   0.000     .1222908    .2296954
                       494  |   .1812912   .0273878     6.62   0.000     .1276103     .234972
                       495  |    .186744   .0273335     6.83   0.000     .1331695    .2403184
                       496  |   .1912047   .0272399     7.02   0.000     .1378136    .2445958
                       497  |   .1954388   .0271726     7.19   0.000     .1421796    .2486979
                       498  |   .2002984   .0271228     7.38   0.000     .1471369    .2534598
                       499  |   .2054119    .027052     7.59   0.000     .1523892    .2584347
                       500  |   .2107229   .0269345     7.82   0.000     .1579304    .2635153
                       501  |   .2146408   .0268519     7.99   0.000     .1620103    .2672714
                       502  |   .2167599    .026777     8.09   0.000     .1642761    .2692436
                       503  |   .2187681   .0267209     8.19   0.000     .1663944    .2711419
                       504  |   .2220914   .0266744     8.33   0.000     .1698089    .2743739
                       505  |    .226024   .0265828     8.50   0.000     .1739209    .2781271
                       506  |   .2289326   .0265281     8.63   0.000     .1769367    .2809286
                       507  |    .230223   .0264794     8.69   0.000     .1783227    .2821234
                       508  |   .2320801    .026423     8.78   0.000     .1802901      .28387
                       509  |   .2353106   .0263542     8.93   0.000     .1836556    .2869656
                       510  |   .2384608   .0263117     9.06   0.000      .186889    .2900325
                       511  |   .2418513   .0262517     9.21   0.000     .1903971    .2933055
                       512  |   .2454984   .0262335     9.36   0.000       .19408    .2969169
                       513  |   .2489618   .0262469     9.49   0.000     .1975172    .3004064
                       514  |   .2516208   .0262711     9.58   0.000     .2001287    .3031128
                       515  |   .2550343    .026278     9.71   0.000     .2035286    .3065401
                       516  |   .2592118   .0262821     9.86   0.000      .207698    .3107255
                       517  |   .2621629   .0262793     9.98   0.000     .2106546    .3136712
                       518  |   .2657147   .0262523    10.12   0.000     .2142594      .31717
                       519  |   .2703382   .0262021    10.32   0.000     .2189813    .3216951
                       520  |   .2757102    .026145    10.55   0.000     .2244652    .3269552
                       521  |   .2806957   .0261382    10.74   0.000      .229464    .3319274
                       522  |   .2859227   .0261985    10.91   0.000     .2345728    .3372726
                       523  |   .2922975   .0262647    11.13   0.000     .2408179    .3437771
                       524  |   .2983378   .0262367    11.37   0.000     .2469132    .3497625
                       525  |   .3038411   .0261917    11.60   0.000     .2525046    .3551777
                       526  |   .3076197   .0261759    11.75   0.000     .2563141    .3589253
                       527  |   .3115859   .0261872    11.90   0.000     .2602582    .3629136
                       528  |   .3171604   .0261709    12.12   0.000     .2658647    .3684561
                       529  |   .3212732   .0262197    12.25   0.000     .2698817    .3726647
                       530  |   .3278296   .0263114    12.46   0.000     .2762585    .3794008
                       531  |   .3345616   .0264749    12.64   0.000     .2826699    .3864533
                       532  |   .3403006   .0265793    12.80   0.000     .2882044    .3923967
                       533  |    .344653   .0266061    12.95   0.000     .2925042    .3968018
                       534  |   .3488752   .0266761    13.08   0.000     .2965893    .4011611
                       535  |    .352898    .026742    13.20   0.000     .3004828    .4053132
                       536  |   .3575385   .0268324    13.32   0.000     .3049462    .4101307
                       537  |   .3628997   .0269219    13.48   0.000      .310132    .4156674
                       538  |   .3686473   .0270021    13.65   0.000     .3157224    .4215723
                       539  |    .375671   .0271133    13.86   0.000     .3225282    .4288138
                       540  |   .3828627   .0272623    14.04   0.000     .3294278    .4362977
                       541  |   .3879992   .0274272    14.15   0.000      .334241    .4417574
                       542  |   .3939099   .0275235    14.31   0.000      .339963    .4478568
                       543  |   .3988971   .0276369    14.43   0.000     .3447278    .4530663
                       544  |   .4033288     .02779    14.51   0.000     .3488596     .457798
                       545  |    .408995   .0279671    14.62   0.000     .3541786    .4638113
                       546  |   .4143806   .0280905    14.75   0.000     .3593224    .4694389
                       547  |   .4194799   .0281899    14.88   0.000     .3642268    .4747331
                       548  |   .4236045   .0282967    14.97   0.000     .3681422    .4790668
                       549  |   .4270006   .0284351    15.02   0.000     .3712669    .4827344
                       550  |   .4302213   .0285632    15.06   0.000     .3742366    .4862059
                       551  |   .4340919     .02866    15.15   0.000     .3779174    .4902663
                       552  |   .4365305   .0287929    15.16   0.000     .3800955    .4929655
                       553  |   .4369227   .0289112    15.11   0.000      .380256    .4935895
                       554  |   .4380447   .0290033    15.10   0.000     .3811974    .4948921
                       555  |   .4386577   .0290934    15.08   0.000     .3816339    .4956816
                       556  |   .4395282   .0291597    15.07   0.000     .3823744    .4966821
                       557  |   .4423906   .0291868    15.16   0.000     .3851836    .4995976
                       558  |   .4454886   .0291727    15.27   0.000     .3883092    .5026679
                       559  |   .4470036   .0291516    15.33   0.000     .3898656    .5041415
                       560  |   .4469054   .0291322    15.34   0.000     .3898054    .5040054
                       561  |     .44675   .0290286    15.39   0.000     .3898531    .5036469
                       562  |   .4463493   .0289352    15.43   0.000     .3896354    .5030632
                       563  |   .4453527   .0288273    15.45   0.000     .3888504     .501855
                       564  |   .4453593   .0287811    15.47   0.000     .3889474    .5017711
                       565  |   .4449599   .0287454    15.48   0.000      .388618    .5013018
                       566  |   .4434053   .0286881    15.46   0.000     .3871759    .4996348
                       567  |   .4415256   .0285812    15.45   0.000     .3855055    .4975457
                       568  |   .4396092   .0284737    15.44   0.000     .3837999    .4954185
                       569  |   .4375766   .0283791    15.42   0.000     .3819527    .4932006
                       570  |   .4348406   .0283353    15.35   0.000     .3793025    .4903786
                       571  |   .4323625   .0283019    15.28   0.000     .3768899    .4878352
                       572  |   .4297926   .0282393    15.22   0.000     .3744428    .4851424
                       573  |   .4273213   .0281337    15.19   0.000     .3721783    .4824642
                       574  |    .425266   .0280167    15.18   0.000     .3703524    .4801796
                       575  |   .4232565   .0278327    15.21   0.000     .3687037    .4778094
                       576  |    .422339   .0276039    15.30   0.000     .3682345    .4764434
                       577  |   .4208567   .0274291    15.34   0.000     .3670948    .4746186
                       578  |   .4181576   .0272637    15.34   0.000       .36472    .4715952
                       579  |   .4164777    .027109    15.36   0.000     .3633431    .4696122
                       580  |   .4145679   .0269433    15.39   0.000     .3617583    .4673775
                       581  |   .4110229   .0267978    15.34   0.000     .3584984    .4635473
                       582  |   .4070783   .0266852    15.25   0.000     .3547745     .459382
                       583  |   .4053681   .0265305    15.28   0.000     .3533674    .4573688
                       584  |   .4024927   .0264055    15.24   0.000     .3507372    .4542482
                       585  |   .3997484   .0263296    15.18   0.000     .3481416    .4513553
                       586  |   .3977552   .0262853    15.13   0.000     .3462352    .4492752
                       587  |   .3963613   .0262574    15.10   0.000     .3448959    .4478266
                       588  |   .3955696   .0262567    15.07   0.000     .3441057    .4470336
                       589  |   .3945655   .0262867    15.01   0.000     .3430429    .4460882
                       590  |    .392607   .0263414    14.90   0.000     .3409771    .4442368
                       591  |   .3896133   .0264316    14.74   0.000     .3378066    .4414199
                       592  |   .3864497   .0265488    14.56   0.000     .3344134    .4384861
                       593  |   .3829228   .0266712    14.36   0.000     .3306465    .4351991
                       594  |   .3802625   .0267581    14.21   0.000     .3278158    .4327092
                       595  |   .3770864    .026793    14.07   0.000     .3245713    .4296014
                       596  |   .3743768   .0268248    13.96   0.000     .3217995    .4269542
                       597  |   .3723128   .0268386    13.87   0.000     .3197083    .4249174
                       598  |   .3707006   .0268232    13.82   0.000     .3181263    .4232748
                       599  |   .3648667   .0267151    13.66   0.000     .3125043    .4172291
                       600  |   .3559622    .026677    13.34   0.000     .3036745      .40825
                       601  |   .3517312   .0267343    13.16   0.000     .2993312    .4041312
                       602  |   .3564012   .0262456    13.58   0.000     .3049591    .4078433
                       603  |   .3575784   .0262114    13.64   0.000     .3062033    .4089534
                       604  |   .3592218   .0261903    13.72   0.000      .307888    .4105556
                       605  |   .3592321   .0261889    13.72   0.000     .3079011     .410563
                       606  |   .3574162   .0261791    13.65   0.000     .3061045     .408728
                       607  |   .3518867   .0259619    13.55   0.000     .3010007    .4027728
                       608  |   .3498246   .0259901    13.46   0.000     .2988832    .4007661
                       609  |   .3488791   .0260177    13.41   0.000     .2978837    .3998746
                       610  |    .346455   .0260141    13.32   0.000     .2954665    .3974435
                       611  |   .3437905   .0260273    13.21   0.000     .2927761    .3948049
                       612  |   .3406432   .0260372    13.08   0.000     .2896096    .3916768
                       613  |    .337676   .0260639    12.96   0.000     .2865899    .3887621
                       614  |   .3347533   .0260555    12.85   0.000     .2836838    .3858228
                       615  |   .3303692   .0260421    12.69   0.000     .2793259    .3814125
                       616  |   .3262387   .0260161    12.54   0.000     .2752464    .3772311
                       617  |   .3232228   .0259956    12.43   0.000     .2722705     .374175
                       618  |   .3209803   .0259993    12.35   0.000      .270021    .3719396
                       619  |   .3191502    .025974    12.29   0.000     .2682404    .3700601
                       620  |     .31674    .025934    12.21   0.000     .2659085    .3675714
                       621  |   .3140282   .0259047    12.12   0.000     .2632542    .3648022
                       622  |   .3115064   .0258951    12.03   0.000     .2607512    .3622617
                       623  |   .3104487   .0258905    11.99   0.000     .2597025     .361195
                       624  |   .3114014   .0258838    12.03   0.000     .2606683    .3621345
                       625  |   .3121559    .025901    12.05   0.000     .2613891    .3629227
                       626  |   .3124865   .0259225    12.05   0.000     .2616775    .3632954
                       627  |   .3125513   .0259386    12.05   0.000     .2617109    .3633918
                       628  |   .3124175    .025953    12.04   0.000     .2615488    .3632862
                       629  |   .3127768   .0259786    12.04   0.000      .261858    .3636957
                       630  |   .3134175   .0259959    12.06   0.000     .2624648    .3643702
                       631  |   .3139411    .025979    12.08   0.000     .2630215    .3648607
                       632  |   .3149611   .0259549    12.13   0.000     .2640887    .3658334
                       633  |    .316845   .0259392    12.21   0.000     .2660035    .3676866
                       634  |   .3190982   .0259166    12.31   0.000      .268301    .3698955
                       635  |   .3214067   .0258914    12.41   0.000     .2706587    .3721547
                       636  |   .3228905   .0258589    12.49   0.000     .2722064    .3735747
                       637  |   .3241708   .0258497    12.54   0.000     .2735045    .3748371
                       638  |   .3257246   .0258433    12.60   0.000     .2750709    .3763783
                       639  |   .3276658   .0258397    12.68   0.000     .2770192    .3783125
                       640  |   .3297003   .0258343    12.76   0.000     .2790642    .3803363
                       641  |   .3314981   .0258245    12.84   0.000     .2808813    .3821149
                       642  |   .3316753   .0258236    12.84   0.000     .2810602    .3822903
                       643  |   .3321493   .0258347    12.86   0.000     .2815124    .3827861
                       644  |   .3323185   .0258701    12.85   0.000     .2816124    .3830246
                       645  |   .3319759   .0259151    12.81   0.000     .2811816    .3827703
                       646  |   .3319025    .025945    12.79   0.000     .2810496    .3827554
                       647  |     .33315   .0259428    12.84   0.000     .2823013    .3839988
                       648  |   .3347205   .0259377    12.90   0.000     .2838818    .3855593
                       649  |   .3363877    .025925    12.98   0.000      .285574    .3872015
                       650  |   .3381218   .0259159    13.05   0.000     .2873258    .3889178
                       651  |   .3395613   .0259007    13.11   0.000     .2887952    .3903274
                       652  |   .3410169   .0258759    13.18   0.000     .2902994    .3917344
                       653  |   .3428413   .0258637    13.26   0.000     .2921477    .3935348
                       654  |   .3464005   .0258649    13.39   0.000     .2957046    .3970965
                       655  |   .3500711   .0258769    13.53   0.000     .2993515    .4007906
                       656  |    .351827   .0258971    13.59   0.000     .3010679    .4025861
                       657  |   .3518885   .0259042    13.58   0.000     .3011155    .4026616
                       658  |   .3524241   .0259254    13.59   0.000     .3016095    .4032387
                       659  |    .354597   .0259024    13.69   0.000     .3038275    .4053665
                       660  |   .3583923   .0258704    13.85   0.000     .3076856     .409099
                       661  |   .3621026   .0258454    14.01   0.000     .3114448    .4127604
                       662  |   .3641931   .0258427    14.09   0.000     .3135406    .4148456
                       663  |   .3662728   .0258334    14.18   0.000     .3156386    .4169071
                       664  |   .3691551   .0258384    14.29   0.000     .3185111    .4197991
                       665  |   .3724757   .0258852    14.39   0.000       .32174    .4232114
                       666  |   .3757267   .0259274    14.49   0.000     .3249082    .4265452
                       667  |   .3785757   .0259625    14.58   0.000     .3276884     .429463
                       668  |   .3814443   .0259988    14.67   0.000      .330486    .4324027
                       669  |   .3833324   .0260587    14.71   0.000     .3322566    .4344083
                       670  |   .3838829   .0261147    14.70   0.000     .3326973    .4350685
                       671  |   .3838797    .026157    14.68   0.000     .3326111    .4351483
                       672  |   .3848786   .0261933    14.69   0.000     .3335389    .4362184
                       673  |   .3881266   .0262176    14.80   0.000     .3367394    .4395138
                       674  |   .3932304   .0262301    14.99   0.000     .3418187    .4446422
                       675  |   .3983364   .0262515    15.17   0.000     .3468826    .4497902
                       676  |   .4014403   .0262919    15.27   0.000     .3499073    .4529733
                       677  |   .4026676   .0263307    15.29   0.000     .3510586    .4542766
                       678  |   .4040954   .0263321    15.35   0.000     .3524836    .4557072
                       679  |   .4059356   .0263466    15.41   0.000     .3542955    .4575757
                       680  |   .4098482   .0263469    15.56   0.000     .3582075    .4614888
                       681  |    .415929   .0263431    15.79   0.000     .3642958    .4675623
                       682  |   .4235908   .0263428    16.08   0.000      .371958    .4752236
                       683  |   .4304064   .0263458    16.34   0.000     .3787679    .4820449
                       684  |   .4364426   .0263381    16.57   0.000      .384819    .4880661
                       685  |   .4405925   .0263241    16.74   0.000     .3889965    .4921884
                       686  |   .4440561   .0263236    16.87   0.000      .392461    .4956511
                       687  |   .4479122   .0263618    16.99   0.000     .3962422    .4995822
                       688  |   .4522294    .026418    17.12   0.000     .4004493    .5040096
                       689  |   .4560284   .0264634    17.23   0.000     .4041594    .5078974
                       690  |   .4593032   .0264802    17.35   0.000     .4074012    .5112052
                       691  |   .4627364   .0264809    17.47   0.000     .4108331    .5146397
                       692  |   .4664304   .0264973    17.60   0.000     .4144949    .5183659
                       693  |   .4702213   .0265079    17.74   0.000     .4182651    .5221776
                       694  |   .4736362   .0265391    17.85   0.000     .4216188    .5256535
                       695  |   .4768097   .0266424    17.90   0.000     .4245898    .5290296
                       696  |      .4789   .0267574    17.90   0.000     .4264546    .5313454
                            |
                      _cons |   11.21796   .0267154   419.91   0.000     11.16559    11.27032
----------------------------+----------------------------------------------------------------
                 regionname |   absorbed                                     (176 categories)
(note: file ../output/event_study_wind_panel_zip_zhvi_month.png not found)
(file ../output/event_study_wind_panel_zip_zhvi_month.png written in PNG format)

Linear regression, absorbing indicators         Number of obs     =      5,016
                                                F(  51,   4709)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.8413
                                                Adj R-squared     =     0.8309
                                                Root MSE          =     0.1025

--------------------------------------------------------------------------------------------
                           |               Robust
                      ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
relative_ev_year_reggroups |
                        0  |  -.0058178   .0106126    -0.55   0.584    -.0266236    .0149879
                        1  |  -.0074346   .0100612    -0.74   0.460    -.0271593    .0122901
                        2  |  -.0010207   .0095092    -0.11   0.915    -.0196632    .0176218
                        3  |  -.0036305    .008945    -0.41   0.685     -.021167    .0139059
                        4  |  -.0030321   .0088653    -0.34   0.732    -.0204124    .0143481
                        5  |  -.0102262   .0088923    -1.15   0.250    -.0276594    .0072069
                        7  |  -.0005349    .009347    -0.06   0.954    -.0188594    .0177897
                        8  |  -.0069289   .0101651    -0.68   0.495    -.0268573    .0129994
                        9  |  -.0061124   .0101608    -0.60   0.547    -.0260323    .0138074
                       10  |   .0015656    .010775     0.15   0.884    -.0195585    .0226897
                       11  |  -.0101372   .0113382    -0.89   0.371    -.0323653    .0120909
                       12  |  -.0094578   .0121319    -0.78   0.436     -.033242    .0143265
                       13  |    .005255   .0144962     0.36   0.717    -.0231643    .0336742
                     1000  |   .0145837   .0134737     1.08   0.279    -.0118311    .0409985
                           |
                      year |
                     1980  |   .0837893   8.76e-08  9.6e+05   0.000     .0837892    .0837895
                     1981  |   .0690594   9.32e-08  7.4e+05   0.000     .0690592    .0690596
                     1982  |   .2008176   .0987187     2.03   0.042     .0072828    .3943525
                     1983  |   .2939876   .0378547     7.77   0.000     .2197747    .3682006
                     1984  |   .1897005   .0605398     3.13   0.002     .0710142    .3083868
                     1985  |   .2154699   .0348605     6.18   0.000      .147127    .2838128
                     1986  |   .1033701   .0544214     1.90   0.058    -.0033213    .2100615
                     1987  |   .1009311   .0517682     1.95   0.051    -.0005588     .202421
                     1988  |    .092665    .046379     2.00   0.046     .0017404    .1835897
                     1989  |   .2133895   .0337419     6.32   0.000     .1472395    .2795394
                     1990  |   .3064161   .0395031     7.76   0.000     .2289716    .3838605
                     1991  |   .3210852      .0325     9.88   0.000       .25737    .3848004
                     1992  |   .3131662   .0235831    13.28   0.000     .2669323    .3594001
                     1993  |   .3334858   .0214857    15.52   0.000     .2913637    .3756079
                     1994  |   .3869573   .0203823    18.98   0.000     .3469983    .4269162
                     1995  |   .4616483   .0197778    23.34   0.000     .4228746    .5004221
                     1996  |    .493074   .0198383    24.85   0.000     .4541816    .5319664
                     1997  |   .5388285   .0210843    25.56   0.000     .4974935    .5801635
                     1998  |   .5792346   .0183532    31.56   0.000     .5432537    .6152155
                     1999  |   .6220354   .0184756    33.67   0.000     .5858146    .6582561
                     2000  |   .6775164   .0184537    36.71   0.000     .6413385    .7136943
                     2001  |   .7075161    .017767    39.82   0.000     .6726846    .7423476
                     2002  |   .7339188   .0178113    41.21   0.000     .6990004    .7688372
                     2003  |   .7535644    .017914    42.07   0.000     .7184447    .7886842
                     2004  |   .8028548   .0181122    44.33   0.000     .7673464    .8383632
                     2005  |   .8789357   .0185492    47.38   0.000     .8425705    .9153009
                     2006  |   .9258105   .0190584    48.58   0.000      .888447    .9631739
                     2007  |   .9562712   .0191145    50.03   0.000     .9187978    .9937446
                     2008  |   .9575074   .0192327    49.79   0.000     .9198022    .9952125
                     2009  |   .9278367   .0195289    47.51   0.000     .8895509    .9661225
                     2010  |   .8991131   .0201732    44.57   0.000     .8595643     .938662
                     2011  |    .882145   .0210005    42.01   0.000     .8409743    .9233157
                     2012  |   .8786237   .0217743    40.35   0.000     .8359359    .9213115
                     2013  |   .8959637   .0225444    39.74   0.000     .8517662    .9401613
                     2014  |   .9109213   .0235346    38.71   0.000     .8647826    .9570601
                     2015  |   .9454918   .0241088    39.22   0.000     .8982272    .9927563
                     2016  |   .9751937   .0248041    39.32   0.000     .9265662    1.023821
                     2017  |   1.012028    .025533    39.64   0.000      .961971    1.062084
                           |
                     _cons |   4.109606   .0203659   201.79   0.000     4.069679    4.149532
---------------------------+----------------------------------------------------------------
                 tract_fip |   absorbed                                     (255 categories)
(note: file ../output/event_study_wind_panel_tract_fhfa_year.png not found)
(file ../output/event_study_wind_panel_tract_fhfa_year.png written in PNG format)

Linear regression, absorbing indicators         Number of obs     =      5,820
                                                F(  56,   5509)   =     303.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.8860
                                                Adj R-squared     =     0.8796
                                                Root MSE          =     0.1175

--------------------------------------------------------------------------------------------
                           |               Robust
                      ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
relative_ev_year_reggroups |
                        0  |   .0071792   .0118424     0.61   0.544    -.0160365    .0303949
                        1  |   .0077882   .0113927     0.68   0.494    -.0145461    .0301225
                        2  |   .0064435    .010874     0.59   0.553    -.0148738    .0277608
                        3  |    .005554   .0105398     0.53   0.598    -.0151082    .0262163
                        4  |   .0018744   .0106479     0.18   0.860    -.0189998    .0227485
                        5  |  -.0038596   .0108625    -0.36   0.722    -.0251543    .0174351
                        7  |  -.0063476   .0111376    -0.57   0.569    -.0281816    .0154864
                        8  |  -.0102724   .0119751    -0.86   0.391    -.0337482    .0132035
                        9  |  -.0147625   .0121682    -1.21   0.225    -.0386169     .009092
                       10  |  -.0299408   .0126521    -2.37   0.018     -.054744   -.0051377
                       11  |  -.0343506   .0131987    -2.60   0.009    -.0602252    -.008476
                       12  |  -.0376276    .013699    -2.75   0.006     -.064483   -.0107722
                       13  |  -.0431876   .0157989    -2.73   0.006    -.0741595   -.0122156
                     1000  |  -.0227463   .0147065    -1.55   0.122    -.0515768    .0060842
                           |
                      year |
                     1976  |   .1231505   .2369915     0.52   0.603    -.3414464    .5877475
                     1977  |   .2689484   .2055534     1.31   0.191    -.1340173    .6719141
                     1978  |   .4360644    .200609     2.17   0.030     .0427915    .8293372
                     1979  |   .5723931   .1925491     2.97   0.003     .1949209    .9498653
                     1980  |   .6346267   .1918277     3.31   0.001     .2585688    1.010685
                     1981  |   .7052798   .1915484     3.68   0.000     .3297693     1.08079
                     1982  |   .7739144   .1941855     3.99   0.000     .3932341    1.154595
                     1983  |   .7901643   .1931463     4.09   0.000     .4115215    1.168807
                     1984  |   .7902463   .1930528     4.09   0.000     .4117867    1.168706
                     1985  |   .7765372   .1889513     4.11   0.000      .406118    1.146956
                     1986  |   .7485451   .1873594     4.00   0.000     .3812467    1.115843
                     1987  |   .7344122   .1873449     3.92   0.000     .3671423    1.101682
                     1988  |    .715525    .187803     3.81   0.000     .3473569    1.083693
                     1989  |   .7752747    .187539     4.13   0.000     .4076243    1.142925
                     1990  |   .8037549    .187934     4.28   0.000       .43533     1.17218
                     1991  |   .8500405   .1872458     4.54   0.000     .4829649    1.217116
                     1992  |   .8778826   .1869638     4.70   0.000     .5113598    1.244406
                     1993  |   .9052174   .1868833     4.84   0.000     .5388524    1.271582
                     1994  |    .955229   .1868386     5.11   0.000     .5889516    1.321507
                     1995  |   1.011695   .1868481     5.41   0.000     .6453985    1.377991
                     1996  |   1.055757   .1868467     5.65   0.000     .6894641    1.422051
                     1997  |   1.091271   .1869156     5.84   0.000     .7248424    1.457699
                     1998  |   1.124929   .1868488     6.02   0.000     .7586316    1.491226
                     1999  |   1.159226   .1868694     6.20   0.000     .7928885    1.525564
                     2000  |    1.19931   .1869197     6.42   0.000     .8328736    1.565746
                     2001  |   1.252268   .1869005     6.70   0.000     .8858697    1.618667
                     2002  |   1.279511   .1869161     6.85   0.000      .913082    1.645941
                     2003  |   1.303492   .1869419     6.97   0.000     .9370121    1.669972
                     2004  |   1.357572   .1870122     7.26   0.000     .9909546     1.72419
                     2005  |   1.424077   .1871416     7.61   0.000     1.057206    1.790949
                     2006  |   1.478973   .1872124     7.90   0.000     1.111963    1.845983
                     2007  |   1.512636   .1872158     8.08   0.000     1.145619    1.879653
                     2008  |   1.512681   .1872166     8.08   0.000     1.145662    1.879699
                     2009  |   1.484148   .1872748     7.92   0.000     1.117015    1.851281
                     2010  |   1.459517   .1873942     7.79   0.000      1.09215    1.826883
                     2011  |   1.445932   .1875377     7.71   0.000     1.078284     1.81358
                     2012  |   1.450827   .1876554     7.73   0.000     1.082948    1.818706
                     2013  |   1.473356   .1877891     7.85   0.000     1.105215    1.841497
                     2014  |   1.508323    .187985     8.02   0.000     1.139798    1.876848
                     2015  |    1.54258   .1881157     8.20   0.000     1.173799    1.911361
                     2016  |   1.567738   .1882328     8.33   0.000     1.198727    1.936748
                     2017  |   1.604379   .1883358     8.52   0.000     1.235167    1.973592
                           |
                     _cons |   3.702941   .1874341    19.76   0.000     3.335496    4.070386
---------------------------+----------------------------------------------------------------
                regionname |   absorbed                                     (255 categories)
(note: file ../output/event_study_wind_panel_zip_fhfa_year.png not found)
(file ../output/event_study_wind_panel_zip_fhfa_year.png written in PNG format)

Linear regression, absorbing indicators         Number of obs     =        864
                                                F(  54,    775)   =      96.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9289
                                                Adj R-squared     =     0.9209
                                                Root MSE          =     0.1044

--------------------------------------------------------------------------------------------
                           |               Robust
                      ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
relative_ev_year_reggroups |
                        0  |  -.0537089   .0268707    -2.00   0.046    -.1064569    -.000961
                        1  |   .0174231   .0271496     0.64   0.521    -.0358723    .0707186
                        2  |   .0317676   .0280732     1.13   0.258    -.0233411    .0868762
                        3  |   .0369781   .0272657     1.36   0.175    -.0165454    .0905015
                        4  |   .0276223   .0244779     1.13   0.259    -.0204284    .0756731
                        5  |   .0148439   .0243497     0.61   0.542    -.0329553     .062643
                        7  |   .0058584   .0247598     0.24   0.813    -.0427458    .0544627
                        8  |  -.0173246   .0256251    -0.68   0.499    -.0676275    .0329782
                        9  |   .0039361   .0326949     0.12   0.904     -.060245    .0681172
                       10  |   .0176049   .0321601     0.55   0.584    -.0455264    .0807362
                       11  |   .0625686   .0294987     2.12   0.034     .0046618    .1204753
                       12  |   .0835615   .0334344     2.50   0.013     .0179288    .1491942
                       13  |   .0593417   .0406506     1.46   0.145    -.0204567      .13914
                     1000  |   .0617399   .0390168     1.58   0.114    -.0148513    .1383311
                           |
                      year |
                     1978  |   .0734738   .1409544     0.52   0.602    -.2032239    .3501715
                     1979  |   .1440651   .1295892     1.11   0.267    -.1103223    .3984526
                     1980  |   .1584981    .138087     1.15   0.251    -.1125708    .4295671
                     1981  |   .2060669   .1314961     1.57   0.118    -.0520638    .4641977
                     1982  |   .2839745   .1140171     2.49   0.013     .0601556    .5077935
                     1983  |   .2500735   .1196934     2.09   0.037     .0151117    .4850352
                     1984  |   .2900339   .1187056     2.44   0.015     .0570113    .5230565
                     1985  |   .2919505   .1163161     2.51   0.012     .0636185    .5202825
                     1986  |   .3345859   .1155045     2.90   0.004     .1078472    .5613246
                     1987  |   .3601616   .1157717     3.11   0.002     .1328983     .587425
                     1988  |    .374012   .1144659     3.27   0.001     .1493121    .5987119
                     1989  |    .416521   .1171508     3.56   0.000     .1865505    .6464914
                     1990  |   .4516627   .1139833     3.96   0.000     .2279102    .6754153
                     1991  |   .5213437   .1141713     4.57   0.000      .297222    .7454654
                     1992  |   .5503106   .1150826     4.78   0.000     .3244001     .776221
                     1993  |   .6048152   .1143567     5.29   0.000     .3803297    .8293008
                     1994  |   .6657434   .1138534     5.85   0.000     .4422458     .889241
                     1995  |   .7331948   .1139066     6.44   0.000     .5095928    .9567968
                     1996  |   .7763115   .1140109     6.81   0.000     .5525046    1.000118
                     1997  |   .8346625   .1148841     7.27   0.000     .6091415    1.060183
                     1998  |   .8821262   .1143963     7.71   0.000     .6575629    1.106689
                     1999  |    .908914    .114674     7.93   0.000     .6838056    1.134022
                     2000  |   .9543552   .1143632     8.34   0.000     .7298568    1.178854
                     2001  |   1.006817   .1145782     8.79   0.000      .781897    1.231738
                     2002  |   1.024368   .1140431     8.98   0.000     .8004983    1.248238
                     2003  |   1.033564   .1142114     9.05   0.000     .8093633    1.257764
                     2004  |   1.080064    .114437     9.44   0.000     .8554208    1.304707
                     2005  |   1.131689    .115414     9.81   0.000     .9051284    1.358251
                     2006  |   1.160956   .1158748    10.02   0.000     .9334901    1.388422
                     2007  |   1.187855   .1159003    10.25   0.000     .9603394    1.415371
                     2008  |   1.174213   .1152832    10.19   0.000     .9479083    1.400517
                     2009  |   1.121214   .1150203     9.75   0.000     .8954258    1.347002
                     2010  |   1.060964   .1156132     9.18   0.000      .834012    1.287916
                     2011  |   1.019376   .1162622     8.77   0.000     .7911503    1.247602
                     2012  |   1.014706   .1170232     8.67   0.000     .7849861    1.244426
                     2013  |   1.016273   .1176234     8.64   0.000     .7853751    1.247172
                     2014  |   1.023578   .1181601     8.66   0.000     .7916261     1.25553
                     2015  |   1.073229   .1184663     9.06   0.000      .840676    1.305782
                     2016  |   1.109342   .1191568     9.31   0.000     .8754337     1.34325
                     2017  |   1.158664   .1196021     9.69   0.000     .9238812    1.393446
                           |
                     _cons |   4.174725   .1160443    35.98   0.000     3.946926    4.402523
---------------------------+----------------------------------------------------------------
                regionname |   absorbed                                      (35 categories)
(note: file ../output/event_study_wind_panel_zip_fhfa_hazard_year.png not found)
(file ../output/event_study_wind_panel_zip_fhfa_hazard_year.png written in PNG format)

Linear regression, absorbing indicators         Number of obs     =        744
                                                F(  53,    656)   =          .
                                                Prob > F          =          .
                                                R-squared         =     0.9425
                                                Adj R-squared     =     0.9349
                                                Root MSE          =     0.1051

--------------------------------------------------------------------------------------------
                           |               Robust
                      ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
relative_ev_year_reggroups |
                        0  |   -.338245   .0338706    -9.99   0.000     -.404753   -.2717371
                        1  |  -.1822408   .0334455    -5.45   0.000     -.247914   -.1165676
                        2  |  -.1430746    .030805    -4.64   0.000    -.2035629   -.0825862
                        3  |   -.122214   .0273122    -4.47   0.000    -.1758439    -.068584
                        4  |  -.0924405   .0241582    -3.83   0.000    -.1398773   -.0450037
                        5  |  -.0453107   .0247892    -1.83   0.068    -.0939864    .0033649
                        7  |   .0221095   .0283033     0.78   0.435    -.0334666    .0776855
                        8  |   .0226025   .0312971     0.72   0.470    -.0388521    .0840572
                        9  |    .131782    .030605     4.31   0.000     .0716865    .1918776
                       10  |   .1564938   .0396229     3.95   0.000     .0786907    .2342968
                       11  |   .1825887    .049629     3.68   0.000     .0851378    .2800397
                       12  |   .2713199   .0870837     3.12   0.002     .1003234    .4423164
                       13  |   .3986354   .1200113     3.32   0.001     .1629828    .6342879
                     1000  |   .5466034   .0427186    12.80   0.000     .4627217    .6304852
                           |
                      year |
                     1976  |   .1513467   2.21e-08  6.8e+06   0.000     .1513466    .1513467
                     1977  |   .2657433          .        .       .            .           .
                     1978  |   .4297671          .        .       .            .           .
                     1979  |   .9664711   .1821134     5.31   0.000     .6088756    1.324067
                     1980  |   1.079363   .1460964     7.39   0.000     .7924898    1.366236
                     1981  |     .91745          .        .       .            .           .
                     1982  |   1.167835   .1176733     9.92   0.000     .9367734    1.398897
                     1983  |   1.189536   .1226183     9.70   0.000     .9487645    1.430308
                     1984  |   1.224605   .1238935     9.88   0.000     .9813295    1.467881
                     1985  |   1.211669   .1101633    11.00   0.000     .9953536    1.427984
                     1986  |   1.208091   .0551011    21.92   0.000     1.099895    1.316287
                     1987  |    1.27875   .0556303    22.99   0.000     1.169515    1.387985
                     1988  |   1.283265   .0494375    25.96   0.000      1.18619     1.38034
                     1989  |   1.357329   .0320483    42.35   0.000     1.294399    1.420259
                     1990  |   1.383568   .0378114    36.59   0.000     1.309322    1.457814
                     1991  |   1.373317   .0371781    36.94   0.000     1.300314    1.446319
                     1992  |   1.360289   .0368752    36.89   0.000     1.287882    1.432697
                     1993  |   1.382811   .0350918    39.41   0.000     1.313906    1.451717
                     1994  |   1.453538    .034624    41.98   0.000      1.38555    1.521525
                     1995  |   1.502585   .0358947    41.86   0.000     1.432103    1.573068
                     1996  |   1.533452   .0383053    40.03   0.000     1.458236    1.608668
                     1997  |   1.596131   .0408775    39.05   0.000     1.515865    1.676398
                     1998  |   1.631883   .0384501    42.44   0.000     1.556383    1.707383
                     1999  |   1.671941   .0391983    42.65   0.000     1.594972     1.74891
                     2000  |   1.727058   .0397818    43.41   0.000     1.648943    1.805173
                     2001  |   1.786101   .0396416    45.06   0.000     1.708261     1.86394
                     2002  |   1.807586   .0396321    45.61   0.000     1.729765    1.885407
                     2003  |   1.837825   .0393913    46.66   0.000     1.760477    1.915173
                     2004  |   1.884123   .0411909    45.74   0.000     1.803241    1.965004
                     2005  |   1.960744   .0466744    42.01   0.000     1.869095    2.052394
                     2006  |    1.99994   .0420444    47.57   0.000     1.917382    2.082497
                     2007  |   2.011388   .0407557    49.35   0.000      1.93136    2.091415
                     2008  |   1.984983   .0387586    51.21   0.000     1.908878    2.061089
                     2009  |   1.911222   .0387243    49.35   0.000     1.835183     1.98726
                     2010  |   1.840311   .0415232    44.32   0.000     1.758777    1.921846
                     2011  |   1.739892   .0448909    38.76   0.000     1.651745    1.828039
                     2012  |   1.682181   .0474987    35.42   0.000     1.588913    1.775449
                     2013  |   1.650291   .0497915    33.14   0.000     1.552521    1.748061
                     2014  |   1.630162   .0512249    31.82   0.000     1.529577    1.730746
                     2015  |   1.614904   .0530828    30.42   0.000     1.510671    1.719136
                     2016  |   1.616176   .0562209    28.75   0.000     1.505781     1.72657
                     2017  |   1.579794   .0605716    26.08   0.000     1.460856    1.698731
                           |
                     _cons |   3.580934   .0509211    70.32   0.000     3.480946    3.680922
---------------------------+----------------------------------------------------------------
                regionname |   absorbed                                      (32 categories)
(note: file ../output/event_study_wind_panel_zip_fhfa_notdetermined_year.png not found)
(file ../output/event_study_wind_panel_zip_fhfa_notdetermined_year.png written in PNG format)

Linear regression, absorbing indicators         Number of obs     =      5,039
                                                F(  56,   4773)   =     375.65
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9053
                                                Adj R-squared     =     0.9001
                                                Root MSE          =     0.1118

--------------------------------------------------------------------------------------------
                           |               Robust
                      ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------------+----------------------------------------------------------------
relative_ev_year_reggroups |
                        0  |   .0000496   .0113596     0.00   0.997    -.0222205    .0223196
                        1  |   .0249651   .0114614     2.18   0.029     .0024955    .0474348
                        2  |   .0230675   .0114779     2.01   0.045     .0005655    .0455695
                        3  |   .0205729   .0115335     1.78   0.075    -.0020381     .043184
                        4  |    .014969   .0112533     1.33   0.184    -.0070927    .0370307
                        5  |   .0017576   .0109992     0.16   0.873    -.0198059    .0233211
                        7  |  -.0079808   .0106994    -0.75   0.456    -.0289566    .0129949
                        8  |  -.0193953   .0112761    -1.72   0.085    -.0415016     .002711
                        9  |  -.0241248   .0128095    -1.88   0.060    -.0492373    .0009876
                       10  |  -.0326003   .0141262    -2.31   0.021    -.0602942   -.0049065
                       11  |  -.0259698   .0146988    -1.77   0.077    -.0547862    .0028465
                       12  |  -.0344874   .0158595    -2.17   0.030    -.0655794   -.0033955
                       13  |  -.0316057   .0182857    -1.73   0.084     -.067454    .0042427
                     1000  |  -.0327276   .0176288    -1.86   0.063    -.0672882    .0018331
                           |
                      year |
                     1976  |  -.1002458   .1253681    -0.80   0.424     -.346025    .1455334
                     1977  |   .1022583   .0678479     1.51   0.132    -.0307549    .2352716
                     1978  |   .2138512   .0585215     3.65   0.000     .0991221    .3285803
                     1979  |   .3029656   .0455649     6.65   0.000     .2136374    .3922938
                     1980  |   .3474542   .0350417     9.92   0.000     .2787564    .4161521
                     1981  |   .3876882    .048323     8.02   0.000     .2929529    .4824235
                     1982  |   .4766864   .0523327     9.11   0.000     .3740903    .5792826
                     1983  |   .4816111   .0470768    10.23   0.000     .3893189    .5739033
                     1984  |   .4764871   .0443074    10.75   0.000     .3896242      .56335
                     1985  |   .5252824   .0366234    14.34   0.000     .4534836    .5970812
                     1986  |   .5179427   .0257629    20.10   0.000     .4674354    .5684499
                     1987  |   .5314958   .0240005    22.15   0.000     .4844437    .5785478
                     1988  |   .5374248    .023237    23.13   0.000     .4918696    .5829801
                     1989  |   .5810812   .0247433    23.48   0.000      .532573    .6295894
                     1990  |   .6082832   .0247354    24.59   0.000     .5597903     .656776
                     1991  |   .6605974   .0229613    28.77   0.000     .6155826    .7056121
                     1992  |    .686442   .0212882    32.25   0.000     .6447073    .7281767
                     1993  |   .7271467    .020427    35.60   0.000     .6871005     .767193
                     1994  |    .775061   .0203889    38.01   0.000     .7350894    .8150327
                     1995  |   .8403859    .020289    41.42   0.000       .80061    .8801617
                     1996  |   .8866277   .0201062    44.10   0.000     .8472103     .926045
                     1997  |   .9352035   .0204219    45.79   0.000     .8951672    .9752398
                     1998  |    .967162   .0202489    47.76   0.000     .9274648    1.006859
                     1999  |   1.008243   .0203269    49.60   0.000     .9683926    1.048093
                     2000  |   1.056313   .0205165    51.49   0.000     1.016091    1.096535
                     2001  |   1.098161   .0204505    53.70   0.000     1.058068    1.138253
                     2002  |   1.123144    .020259    55.44   0.000     1.083427    1.162861
                     2003  |   1.149201   .0200613    57.28   0.000     1.109871     1.18853
                     2004  |   1.192348    .020313    58.70   0.000     1.152525    1.232171
                     2005  |   1.251308   .0206917    60.47   0.000     1.210743    1.291873
                     2006  |   1.299661   .0211967    61.31   0.000     1.258105    1.341216
                     2007  |   1.319587    .020847    63.30   0.000     1.278717    1.360457
                     2008  |   1.321007   .0207845    63.56   0.000      1.28026    1.361754
                     2009  |   1.281688   .0206863    61.96   0.000     1.241134    1.322243
                     2010  |   1.247765   .0211629    58.96   0.000     1.206276    1.289254
                     2011  |   1.227971   .0218653    56.16   0.000     1.185105    1.270837
                     2012  |   1.221333   .0223433    54.66   0.000      1.17753    1.265136
                     2013  |   1.238294    .022951    53.95   0.000       1.1933    1.283289
                     2014  |   1.275166   .0238434    53.48   0.000     1.228422     1.32191
                     2015  |   1.312785   .0242646    54.10   0.000     1.265215    1.360355
                     2016  |   1.344576   .0252288    53.30   0.000     1.295116    1.394036
                     2017  |    1.38686   .0260702    53.20   0.000     1.335751     1.43797
                           |
                     _cons |   3.934944   .0220591   178.38   0.000     3.891698     3.97819
---------------------------+----------------------------------------------------------------
                regionname |   absorbed                                     (210 categories)
(note: file ../output/event_study_wind_panel_zip_fhfa_nobuiltdate_year.png not found)
(file ../output/event_study_wind_panel_zip_fhfa_nobuiltdate_year.png written in PNG format)

. 
end of do-file

 make.py ended: 2018-05-14 17:14:14
