
 make.py started: 2018-03-12 16:40:47 C:\Users\giamb\Documents\GitHub\blowin_wind\analysis\event_study_plots\code 




Execute:  StataSE-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/mental_coupons/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/mental_coupons/ado"
  [9]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     local nbr_quarters 6
  2.     local nbr_months   12
  3. 
.     use "${GoogleDrive}/stata/wind_prices_turbines.dta", clear
  4.     * Restrict to compliers
.     * keep if wind_zip_area_ratio > 60
. 
.     gen ln_p = log(p)
  5.     generate_reggroups, window(`nbr_months') time(dt) stub(month)
  6.     label var relative_ev_month_reggroups "Months relative to completion of first wind turbine"
  7.     save_data "../temp/event_panel_month.dta", key(regionname dt) replace
  8.     
.     use "${GoogleDrive}/stata/wind_prices_turbines.dta", clear
  9.     * Restrict to compliers
.     * keep if wind_zip_area_ratio > 60
. 
.     g qtr = qofd(dofm(dt))
 10.     collapse (mean) p (sum) new_turbines_zip_qtr = new_turbines_zip_month, by(regionname qtr)
 11.     gen ln_p = log(p)
 12.     
.     generate_reggroups, window(`nbr_quarters') time(qtr) stub(qtr)
 13.     label var relative_ev_qtr_reggroups "Quarters relative to completion of first wind turbine"
 14.     save_data "../temp/event_panel_qtr.dta", key(regionname qtr) replace
 15. end

. 
. program generate_reggroups
  1.     syntax, window(int) time(str) [stub(str)]
  2. 
.     egen wind_farm_event = min(cond(new_turbines_zip_`stub' > 0, ///
>         `time', .)), by(regionname)
  3. 
.     keep if !missing(wind_farm_event)
  4. 
.     gen relative_ev_`stub' = `time' - wind_farm_event
  5.     sort regionname relative_ev_`stub'
  6.     gen relevant_time_period = (abs(relative_ev_`stub') <= `window')
  7.     egen relative_ev_`stub'_reggroups = group(relative_ev_`stub') if relevant_time_period
  8.     replace relative_ev_`stub'_reggroups = 0 if relative_ev_`stub' < -`window'
  9.     replace relative_ev_`stub'_reggroups = 1000 if relative_ev_`stub' > `window'
 10. end

. 
. * Execute
. main
(360,291 missing values generated)
(3563986 missing values generated)
(3,563,986 observations deleted)
(71468 missing values generated)
(50,387 real changes made)
(21,081 real changes made)
(data now sorted by regionname dt)
  variable wind_farm_event was float now int
  variable relative_ev_month was float now int
  variable relevant_time_period was float now byte
  variable relative_ev_month_reggroups was float now int
  variable city was str30 now str20
  variable metro was str34 now str30
  variable countyname was str22 now str14
  (2,444,722 bytes saved)
==================================================================================================
File: ../temp/event_panel_month.dta
Key: regionname dt
==================================================================================================
  78862:33(24136):2907080544:236483994

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     78,862    56123.86    26478.88       1247      99337
          dt |     78,862       565.5    75.63281        435        696
        date |          0
    regionid |     78,862    83331.28    21629.27      58312     399714
        city |          0
-------------+---------------------------------------------------------
       state |          0
       metro |          0
  countyname |          0
    sizerank |     78,862    9980.993    4194.257        154      15237
           p |     65,727    118792.6    73418.51      24500     852800
-------------+---------------------------------------------------------
new_turbin~h |     78,862    .1478152    1.795762          0         86
aggr_turb_~h |     78,862    10.60965    32.50462          0        387
   wind_farm |     78,862    .3152722    .4646272          0          1
   zcta5ce10 |     78,862    56123.86    26478.88       1247      99337
    area_zip |     78,862    557.2246    833.6864    6.25326   8191.318
-------------+---------------------------------------------------------
tot_w_wind~p |     78,862    385.1912    662.6985   .1471919   6744.655
wind_zip_a~o |     78,862    62.94978    27.56463   .1531565   99.50662
     zipcode |     78,862    56123.86    26478.88       1247      99337
     returns |     78,862     4518.13    5273.683   378.0002      26042
adj_gr_inc~e |     78,862    226907.3    301385.9      14525    2066480
-------------+---------------------------------------------------------
  avg_income |     78,862     48.3708    13.51765   28.63553   178.6369
  male_ratio |     78,862     .503215    .0282718   .4033104   .7021804
         pop |     78,862    10910.88     13089.5        876      70918
 white_ratio |     78,862    .8947768    .1215397   .3684105    .996472
 black_ratio |     78,862    .0211487    .0401082          0   .3116237
-------------+---------------------------------------------------------
 asian_ratio |     78,862    .0107187     .031955          0   .3851792
   elevation |     78,862    476.2126    397.6627          0       2127
   near_dist |     78,862     314.289    311.6143   .1914912   1302.803
        ln_p |     65,727    11.55645    .4771838   10.10643   13.65628
wind_farm_~t |     78,862    614.3987    48.84525        465        695
-------------+---------------------------------------------------------
relative_e~h |     78,862   -48.89867    90.03433       -260        231
relevant_t~d |     78,862    .0937587    .2914946          0          1
relative_e~s |     78,862    268.5189    441.8545          0       1000




(note: file ../temp/event_panel_month.dta not found)
file ../temp/event_panel_month.dta saved
(118,696 missing values generated)
(1197064 missing values generated)
(1,197,064 observations deleted)
(22657 missing values generated)
(16,096 real changes made)
(6,561 real changes made)
(data now sorted by regionname qtr)
  variable qtr was float now int
  variable wind_farm_event was float now int
  variable relative_ev_qtr was float now byte
  variable relevant_time_period was float now byte
  variable relative_ev_qtr_reggroups was float now int
  variable new_turbines_zip_qtr was double now int
  (476,784 bytes saved)
==================================================================================================
File: ../temp/event_panel_qtr.dta
Key: regionname qtr
==================================================================================================
  26488:9(46057):2950289868:1807956150

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     26,488    56123.86    26479.21       1247      99337
         qtr |     26,488       188.5    25.40225        145        232
           p |     22,159    118940.6    73610.44      24600     852800
new_turbin~r |     26,488    .4400861    4.222566          0        154
        ln_p |     22,159    11.55747    .4775091    10.1105   13.65628
-------------+---------------------------------------------------------
wind_farm_~t |     26,488    204.4751    16.29341        155        231
relative_e~r |     26,488   -15.97508    30.17863        -86         77
relevant_t~d |     26,488    .1446315    .3517356          0          1
relative_e~s |     26,488     248.695    431.1192          0       1000




(note: file ../temp/event_panel_qtr.dta not found)
file ../temp/event_panel_qtr.dta saved

. 
end of do-file


Execute:  StataSE-64 /e do "./figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./figures.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/stata/mental_coupons/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/mental_coupons/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/stata/mental_coupons/ado"
  [9]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     use "../temp/event_panel_month.dta", clear
  2.     prepare_factor_info relative_ev_month if relevant_time_period
  3.     local reg_opts = r(reg_opts)
  4. 
.     make_event_study_plot, depvar(ln_p) time(dt) stub(month) ///
>         saving(wind_farm_event) `reg_opts'
  5. 
.     use "../temp/event_panel_qtr.dta", clear
  6.     prepare_factor_info relative_ev_qtr if relevant_time_period
  7.     local reg_opts = r(reg_opts)
  8. 
.     make_event_study_plot, depvar(ln_p) time(qtr) stub(qtr) ///
>         saving(wind_farm_event) `reg_opts'
  9. end

. 
. program prepare_factor_info, rclass
  1.     syntax anything(name=factor_var) [if]
  2. 
.     qui levelsof `factor_var' `if', local(factor_levels)
  3.     local num_factor_levels: word count `factor_levels'
  4.     local median_factor_value = (`num_factor_levels' + 1)/2
  5.     local base_factor_value = `median_factor_value' - 1
  6.     return local reg_opts = "factor_levels(`factor_levels') " +             ///
>                             "num_factor_levels(`num_factor_levels') " +     ///
>                             "median_factor_value(`median_factor_value')" +  ///
>                             "base_factor_value(`base_factor_value')"
  7. end

. 
. program make_event_study_plot
  1.     syntax, depvar(str) time(str) factor_levels(str) num_factor_levels(str) ///
>         median_factor_value(str) base_factor_value(str) saving(str) * [stub(str)]
  2. 
.     areg `depvar' ib`base_factor_value'.relative_ev_`stub'_reggroups i.`time', ///
>         absorb(regionname) vce(cluster regionname)
  3. 
.     plot_event_study i(1/`num_factor_levels')bn.relative_ev_`stub'_reggroups, ///
>         label(`factor_levels') center xtitle(`: var label relative_ev_`stub'_reggroups') ///
>         ytitle(`: var label `depvar'') xlabel(minmax `median_factor_value', value)      ///
>         saving(../output/`saving'_`stub'.png) `options'
  4. end

. 
. * Execute
. main

Linear regression, absorbing indicators         Number of obs     =     65,727
                                                F( 287,    300)   =     208.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9161
                                                Adj R-squared     =     0.9154
                                                Root MSE          =     0.1388

                                          (Std. Err. adjusted for 301 clusters in regionname)
---------------------------------------------------------------------------------------------
                            |               Robust
                       ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------------+----------------------------------------------------------------
relative_ev_month_reggroups |
                         0  |   .0082275   .0112771     0.73   0.466    -.0139647    .0304197
                         1  |   -.002591   .0048605    -0.53   0.594    -.0121561     .006974
                         2  |  -.0019602   .0045208    -0.43   0.665    -.0108566    .0069362
                         3  |   -.002493   .0041832    -0.60   0.552    -.0107251    .0057391
                         4  |  -.0030512    .003869    -0.79   0.431     -.010665    .0045626
                         5  |  -.0028276   .0035337    -0.80   0.424    -.0097816    .0041264
                         6  |  -.0021335   .0031475    -0.68   0.498    -.0083275    .0040606
                         7  |  -.0020054   .0027262    -0.74   0.463    -.0073702    .0033595
                         8  |  -.0015378   .0023046    -0.67   0.505    -.0060731    .0029975
                         9  |   -.001254   .0019004    -0.66   0.510    -.0049938    .0024859
                        10  |  -.0014822   .0015045    -0.99   0.325    -.0044429    .0014785
                        11  |  -.0005447   .0006897    -0.79   0.430    -.0019021    .0008126
                        13  |   .0004247   .0007177     0.59   0.554    -.0009877     .001837
                        14  |   .0005834   .0013891     0.42   0.675    -.0021503    .0033171
                        15  |   .0002806   .0020829     0.13   0.893    -.0038184    .0043796
                        16  |  -.0002632   .0026887    -0.10   0.922    -.0055544    .0050279
                        17  |   .0003814   .0031835     0.12   0.905    -.0058834    .0066461
                        18  |   .0009678   .0036201     0.27   0.789    -.0061561    .0080917
                        19  |   .0018388    .004047     0.45   0.650    -.0061253    .0098029
                        20  |    .002484   .0044425     0.56   0.576    -.0062584    .0112264
                        21  |   .0026988   .0049472     0.55   0.586    -.0070369    .0124344
                        22  |   .0027147   .0052377     0.52   0.605    -.0075925     .013022
                        23  |   .0031292   .0055987     0.56   0.577    -.0078886    .0141469
                        24  |    .005271   .0060211     0.88   0.382    -.0065779      .01712
                        25  |   .0054036   .0063719     0.85   0.397    -.0071356    .0179429
                      1000  |   .0052053   .0122311     0.43   0.671    -.0188643    .0292748
                            |
                         dt |
                       436  |     .00029   .0014267     0.20   0.839    -.0025176    .0030976
                       437  |  -.0000558   .0023973    -0.02   0.981    -.0047735    .0046619
                       438  |  -.0005042   .0031522    -0.16   0.873    -.0067074     .005699
                       439  |   .0005999    .003721     0.16   0.872    -.0067227    .0079224
                       440  |   .0014832   .0040752     0.36   0.716    -.0065363    .0095028
                       441  |   .0018419   .0043456     0.42   0.672    -.0067097    .0103935
                       442  |   .0028897   .0046368     0.62   0.534    -.0062351    .0120144
                       443  |   .0054097   .0049106     1.10   0.272    -.0042538    .0150733
                       444  |    .009104    .005213     1.75   0.082    -.0011546    .0193627
                       445  |   .0157774   .0065306     2.42   0.016     .0029259     .028629
                       446  |   .0182904   .0066889     2.73   0.007     .0051273    .0314535
                       447  |   .0195865   .0068525     2.86   0.005     .0061014    .0330715
                       448  |   .0209747   .0070638     2.97   0.003     .0070738    .0348757
                       449  |   .0240931   .0072954     3.30   0.001     .0097364    .0384498
                       450  |   .0277974   .0075094     3.70   0.000     .0130196    .0425752
                       451  |   .0299399   .0082001     3.65   0.000      .013803    .0460769
                       452  |   .0323512    .008374     3.86   0.000     .0158718    .0488305
                       453  |   .0348731   .0085845     4.06   0.000     .0179796    .0517666
                       454  |   .0375722   .0088537     4.24   0.000     .0201489    .0549954
                       455  |      .0398   .0091008     4.37   0.000     .0218906    .0577095
                       456  |   .0410926   .0093403     4.40   0.000     .0227117    .0594734
                       457  |   .0473227   .0098517     4.80   0.000     .0279354    .0667099
                       458  |   .0509672   .0101329     5.03   0.000     .0310266    .0709079
                       459  |   .0525383   .0103755     5.06   0.000     .0321203    .0729563
                       460  |   .0545318   .0105189     5.18   0.000     .0338316    .0752319
                       461  |   .0570151   .0106799     5.34   0.000     .0359981    .0780322
                       462  |     .06028   .0108534     5.55   0.000     .0389216    .0816384
                       463  |   .0629326   .0111552     5.64   0.000     .0409803    .0848849
                       464  |    .066066   .0113421     5.82   0.000      .043746    .0883861
                       465  |   .0696738   .0115543     6.03   0.000      .046936    .0924115
                       466  |   .0748912   .0117273     6.39   0.000     .0518131    .0979693
                       467  |   .0796348   .0118465     6.72   0.000     .0563221    .1029476
                       468  |   .0833739   .0120116     6.94   0.000     .0597362    .1070115
                       469  |   .0878382   .0121704     7.22   0.000     .0638881    .1117883
                       470  |   .0937726   .0123247     7.61   0.000     .0695187    .1180264
                       471  |   .0996157   .0126356     7.88   0.000       .07475    .1244814
                       472  |   .1044881   .0130561     8.00   0.000     .0787949    .1301812
                       473  |   .1093255    .013348     8.19   0.000     .0830579    .1355932
                       474  |   .1132551   .0134827     8.40   0.000     .0867225    .1397876
                       475  |   .1148469    .013587     8.45   0.000     .0881091    .1415847
                       476  |   .1178199   .0136428     8.64   0.000     .0909723    .1446676
                       477  |   .1217537   .0136735     8.90   0.000     .0948456    .1486619
                       478  |   .1247668   .0137177     9.10   0.000     .0977718    .1517618
                       479  |   .1271551   .0137409     9.25   0.000     .1001144    .1541958
                       480  |   .1291917    .013776     9.38   0.000     .1020819    .1563016
                       481  |   .1332503   .0139502     9.55   0.000     .1057977    .1607029
                       482  |   .1379358    .014097     9.78   0.000     .1101942    .1656773
                       483  |   .1428578   .0141789    10.08   0.000     .1149552    .1707605
                       484  |   .1468541   .0141942    10.35   0.000     .1189214    .1747869
                       485  |   .1500957   .0141632    10.60   0.000     .1222239    .1779675
                       486  |   .1532219   .0141653    10.82   0.000     .1253459    .1810979
                       487  |   .1572093   .0142625    11.02   0.000      .129142    .1852766
                       488  |   .1606924   .0143423    11.20   0.000     .1324683    .1889166
                       489  |   .1636184   .0143684    11.39   0.000     .1353429    .1918939
                       490  |   .1669002   .0144499    11.55   0.000     .1384643    .1953362
                       491  |   .1714852   .0145742    11.77   0.000     .1428046    .2001658
                       492  |    .177069   .0147096    12.04   0.000     .1481219    .2060162
                       493  |   .1830873   .0148382    12.34   0.000     .1538872    .2122874
                       494  |   .1891221   .0150029    12.61   0.000     .1595978    .2186464
                       495  |   .1950815   .0151952    12.84   0.000     .1651789    .2249841
                       496  |   .2000975   .0153938    13.00   0.000     .1698039     .230391
                       497  |    .204431   .0156109    13.10   0.000     .1737103    .2351517
                       498  |   .2090142   .0157729    13.25   0.000     .1779747    .2400536
                       499  |   .2134098   .0159292    13.40   0.000     .1820628    .2447569
                       500  |   .2179894   .0161191    13.52   0.000     .1862685    .2497103
                       501  |   .2224465   .0162956    13.65   0.000     .1903784    .2545146
                       502  |   .2261364   .0164534    13.74   0.000     .1937578    .2585151
                       503  |   .2298426   .0165839    13.86   0.000      .197207    .2624781
                       504  |    .234283   .0167008    14.03   0.000     .2014174    .2671486
                       505  |   .2375327   .0168354    14.11   0.000     .2044022    .2706632
                       506  |   .2405802   .0169078    14.23   0.000     .2073073     .273853
                       507  |   .2427015   .0169699    14.30   0.000     .2093063    .2760966
                       508  |   .2455397   .0170252    14.42   0.000     .2120358    .2790436
                       509  |   .2487023   .0171138    14.53   0.000      .215024    .2823806
                       510  |   .2514469   .0173045    14.53   0.000     .2173934    .2855004
                       511  |   .2554711   .0175663    14.54   0.000     .2209024    .2900399
                       512  |   .2598237    .017741    14.65   0.000     .2249111    .2947363
                       513  |   .2637279   .0178545    14.77   0.000     .2285919    .2988638
                       514  |   .2674441   .0179753    14.88   0.000     .2320704    .3028178
                       515  |   .2716117   .0181322    14.98   0.000     .2359292    .3072941
                       516  |   .2756891   .0183307    15.04   0.000      .239616    .3117622
                       517  |   .2791206   .0185006    15.09   0.000     .2427132     .315528
                       518  |   .2830901   .0186018    15.22   0.000     .2464836    .3196966
                       519  |   .2874972   .0187162    15.36   0.000     .2506656    .3243288
                       520  |   .2922305   .0188425    15.51   0.000     .2551504    .3293107
                       521  |   .2968163   .0189958    15.63   0.000     .2594344    .3341982
                       522  |    .301659   .0191518    15.75   0.000     .2639702    .3393479
                       523  |   .3073905    .019296    15.93   0.000     .2694178    .3453632
                       524  |   .3131617   .0194335    16.11   0.000     .2749183     .351405
                       525  |   .3186014   .0196184    16.24   0.000     .2799944    .3572084
                       526  |   .3234907   .0198621    16.29   0.000     .2844041    .3625773
                       527  |   .3281333   .0201462    16.29   0.000     .2884876    .3677791
                       528  |   .3339839    .020379    16.39   0.000       .29388    .3740879
                       529  |   .3390492   .0206198    16.44   0.000     .2984715     .379627
                       530  |   .3448825   .0208911    16.51   0.000     .3037709    .3859942
                       531  |   .3514536    .021194    16.58   0.000     .3097458    .3931613
                       532  |   .3587437   .0214697    16.71   0.000     .3164934    .4009941
                       533  |   .3657346   .0217081    16.85   0.000     .3230151    .4084541
                       534  |    .372688   .0219125    17.01   0.000     .3295663    .4158096
                       535  |   .3795704   .0221034    17.17   0.000     .3360731    .4230677
                       536  |   .3862526   .0223401    17.29   0.000     .3422894    .4302158
                       537  |   .3925596   .0225881    17.38   0.000     .3481084    .4370108
                       538  |   .3989482   .0228253    17.48   0.000     .3540303    .4438661
                       539  |   .4058207   .0230474    17.61   0.000     .3604656    .4511757
                       540  |   .4128897   .0232892    17.73   0.000     .3670588    .4587205
                       541  |   .4191685   .0235486    17.80   0.000     .3728272    .4655098
                       542  |   .4258875   .0237761    17.91   0.000     .3790985    .4726765
                       543  |   .4320494   .0239965    18.00   0.000     .3848267    .4792721
                       544  |   .4377043   .0242224    18.07   0.000     .3900369    .4853717
                       545  |     .44338   .0244361    18.14   0.000     .3952923    .4914678
                       546  |     .44889   .0246441    18.21   0.000     .4003928    .4973871
                       547  |    .454567   .0248222    18.31   0.000     .4057193    .5034146
                       548  |   .4597509   .0250096    18.38   0.000     .4105345    .5089673
                       549  |   .4639483    .025189    18.42   0.000     .4143789    .5135177
                       550  |   .4679917     .02536    18.45   0.000     .4180857    .5178976
                       551  |   .4725104   .0254786    18.55   0.000      .422371    .5226497
                       552  |   .4758036   .0255884    18.59   0.000     .4254481    .5261591
                       553  |   .4766963   .0256784    18.56   0.000     .4261637     .527229
                       554  |   .4783378   .0257688    18.56   0.000     .4276273    .5290483
                       555  |   .4793064   .0258763    18.52   0.000     .4283845    .5302284
                       556  |   .4798822   .0259798    18.47   0.000     .4287565    .5310079
                       557  |   .4814542   .0260323    18.49   0.000     .4302252    .5326831
                       558  |   .4832763   .0260343    18.56   0.000     .4320434    .5345092
                       559  |    .483892   .0260049    18.61   0.000      .432717     .535067
                       560  |   .4838296   .0259381    18.65   0.000      .432786    .5348732
                       561  |     .48363   .0258294    18.72   0.000     .4328003    .5344597
                       562  |   .4839453   .0257317    18.81   0.000     .4333078    .5345829
                       563  |   .4842083   .0256707    18.86   0.000     .4336907    .5347258
                       564  |   .4846313   .0256285    18.91   0.000     .4341968    .5350658
                       565  |   .4849863   .0256187    18.93   0.000     .4345712    .5354015
                       566  |   .4844686   .0255727    18.94   0.000      .434144    .5347933
                       567  |   .4829584   .0254732    18.96   0.000     .4328297    .5330871
                       568  |    .481344   .0253646    18.98   0.000     .4314289    .5312591
                       569  |    .479869   .0252852    18.98   0.000     .4301102    .5296278
                       570  |   .4783979   .0252389    18.95   0.000     .4287301    .5280656
                       571  |   .4770824   .0251153    19.00   0.000     .4276579    .5265069
                       572  |    .476013   .0249817    19.05   0.000     .4268515    .5251745
                       573  |   .4747011   .0248203    19.13   0.000     .4258572    .5235451
                       574  |   .4729919   .0246359    19.20   0.000     .4245109    .5214729
                       575  |   .4708319   .0244157    19.28   0.000     .4227842    .5188796
                       576  |   .4684148   .0241862    19.37   0.000     .4208186     .516011
                       577  |   .4648646   .0239718    19.39   0.000     .4176906    .5120387
                       578  |   .4605845   .0237253    19.41   0.000     .4138954    .5072737
                       579  |    .457476   .0234613    19.50   0.000     .4113065    .5036456
                       580  |   .4547019   .0231779    19.62   0.000     .4090901    .5003137
                       581  |   .4508768   .0228856    19.70   0.000     .4058401    .4959136
                       582  |    .447245   .0226177    19.77   0.000     .4027356    .4917543
                       583  |   .4457111   .0223496    19.94   0.000     .4017293    .4896929
                       584  |   .4429398   .0221122    20.03   0.000     .3994251    .4864545
                       585  |   .4402764   .0219128    20.09   0.000      .397154    .4833987
                       586  |   .4375279   .0217318    20.13   0.000     .3947617     .480294
                       587  |   .4354116   .0215686    20.19   0.000     .3929666    .4778566
                       588  |   .4341093   .0214459    20.24   0.000     .3919058    .4763128
                       589  |    .432398   .0213513    20.25   0.000     .3903808    .4744153
                       590  |   .4294205   .0212869    20.17   0.000     .3875299    .4713111
                       591  |   .4255908   .0212678    20.01   0.000     .3837378    .4674438
                       592  |    .421062   .0212398    19.82   0.000     .3792641    .4628599
                       593  |   .4164289   .0212558    19.59   0.000     .3745995    .4582583
                       594  |   .4119933   .0213502    19.30   0.000     .3699782    .4540084
                       595  |   .4077061   .0214832    18.98   0.000     .3654293     .449983
                       596  |   .4037943   .0215921    18.70   0.000     .3613032    .4462855
                       597  |   .4009152   .0217086    18.47   0.000     .3581947    .4436356
                       598  |   .3989626   .0217966    18.30   0.000     .3560691    .4418561
                       599  |   .3932735   .0218306    18.01   0.000     .3503131     .436234
                       600  |   .3848509   .0218819    17.59   0.000     .3417896    .4279123
                       601  |   .3807822    .021998    17.31   0.000     .3374923     .424072
                       602  |   .3851558   .0220266    17.49   0.000     .3418095    .4285021
                       603  |   .3858473   .0221109    17.45   0.000     .3423353    .4293593
                       604  |   .3866217   .0222255    17.40   0.000     .3428841    .4303593
                       605  |   .3862276   .0223168    17.31   0.000     .3423103    .4301448
                       606  |   .3848956   .0223847    17.19   0.000     .3408447    .4289464
                       607  |   .3829027   .0224821    17.03   0.000       .33866    .4271453
                       608  |   .3817945   .0225559    16.93   0.000     .3374067    .4261824
                       609  |   .3804812   .0226717    16.78   0.000     .3358656    .4250969
                       610  |   .3783237   .0227211    16.65   0.000     .3336108    .4230366
                       611  |   .3759871   .0227498    16.53   0.000     .3312178    .4207565
                       612  |   .3735499   .0227523    16.42   0.000     .3287756    .4183243
                       613  |   .3710839   .0227765    16.29   0.000     .3262619    .4159059
                       614  |   .3683617   .0227713    16.18   0.000       .32355    .4131735
                       615  |   .3654278   .0227348    16.07   0.000     .3206879    .4101676
                       616  |   .3622286   .0226923    15.96   0.000     .3175724    .4068848
                       617  |   .3599179   .0226734    15.87   0.000     .3152988    .4045371
                       618  |   .3590081    .022687    15.82   0.000     .3143624    .4036539
                       619  |   .3591493    .022702    15.82   0.000      .314474    .4038246
                       620  |   .3576028   .0227233    15.74   0.000     .3128855    .4023201
                       621  |   .3563223   .0227503    15.66   0.000     .3115519    .4010928
                       622  |   .3553757   .0227659    15.61   0.000     .3105746    .4001768
                       623  |   .3550231   .0227634    15.60   0.000     .3102268    .3998193
                       624  |   .3557722    .022776    15.62   0.000     .3109513    .4005932
                       625  |   .3568531   .0228272    15.63   0.000     .3119314    .4017747
                       626  |   .3578912   .0228832    15.64   0.000     .3128593     .402923
                       627  |   .3586004   .0229449    15.63   0.000     .3134471    .4037537
                       628  |   .3588462   .0229951    15.61   0.000     .3135941    .4040983
                       629  |   .3596653   .0230772    15.59   0.000     .3142515     .405079
                       630  |   .3607917   .0231994    15.55   0.000     .3151376    .4064459
                       631  |   .3619459   .0232974    15.54   0.000     .3160989    .4077928
                       632  |   .3633906   .0233185    15.58   0.000     .3175021     .409279
                       633  |   .3659457   .0233433    15.68   0.000     .3200084    .4118831
                       634  |    .368681   .0234235    15.74   0.000     .3225858    .4147761
                       635  |    .371151   .0234759    15.81   0.000     .3249527    .4173493
                       636  |   .3729468   .0235679    15.82   0.000     .3265675    .4193261
                       637  |   .3748444   .0236462    15.85   0.000      .328311    .4213778
                       638  |   .3767923   .0237027    15.90   0.000     .3301477     .423437
                       639  |   .3794834   .0237884    15.95   0.000     .3326703    .4262966
                       640  |   .3825373   .0238749    16.02   0.000     .3355538    .4295207
                       641  |   .3851837   .0239351    16.09   0.000     .3380818    .4322857
                       642  |   .3868073    .024032    16.10   0.000     .3395147    .4340999
                       643  |   .3886055   .0241894    16.07   0.000     .3410032    .4362079
                       644  |   .3897986   .0243346    16.02   0.000     .3419106    .4376867
                       645  |    .390474   .0244731    15.96   0.000     .3423133    .4386348
                       646  |   .3911668   .0245986    15.90   0.000     .3427591    .4395744
                       647  |   .3928234   .0246585    15.93   0.000     .3442979     .441349
                       648  |   .3954915   .0246863    16.02   0.000     .3469112    .4440717
                       649  |    .397996   .0246792    16.13   0.000     .3494296    .4465623
                       650  |    .399587    .024671    16.20   0.000      .351037    .4481371
                       651  |    .401034   .0246579    16.26   0.000     .3525096    .4495584
                       652  |   .4029026   .0247051    16.31   0.000     .3542854    .4515199
                       653  |   .4055571   .0247183    16.41   0.000     .3569139    .4542004
                       654  |   .4093885   .0247881    16.52   0.000      .360608    .4581691
                       655  |   .4134321   .0248875    16.61   0.000      .364456    .4624083
                       656  |   .4165086    .025007    16.66   0.000     .3672972    .4657199
                       657  |   .4180938   .0251037    16.65   0.000     .3686923    .4674954
                       658  |    .419465   .0252483    16.61   0.000     .3697788    .4691512
                       659  |   .4219611   .0253333    16.66   0.000     .3721076    .4718145
                       660  |   .4254682   .0253518    16.78   0.000     .3755784     .475358
                       661  |   .4289044   .0254133    16.88   0.000     .3788935    .4789154
                       662  |   .4313491   .0254739    16.93   0.000     .3812189    .4814793
                       663  |   .4337436   .0254766    17.03   0.000      .383608    .4838792
                       664  |   .4369193   .0255362    17.11   0.000     .3866666    .4871721
                       665  |   .4408559   .0256629    17.18   0.000     .3903539    .4913579
                       666  |   .4444941    .025767    17.25   0.000     .3937871    .4952011
                       667  |   .4481182   .0258377    17.34   0.000      .397272    .4989643
                       668  |   .4513024   .0258695    17.45   0.000     .4003938     .502211
                       669  |   .4538735   .0259508    17.49   0.000     .4028049     .504942
                       670  |   .4558977   .0259915    17.54   0.000      .404749    .5070464
                       671  |    .457755   .0260201    17.59   0.000     .4065499      .50896
                       672  |   .4598242   .0260361    17.66   0.000     .4085877    .5110607
                       673  |   .4633061   .0260959    17.75   0.000     .4119519    .5146603
                       674  |   .4683225   .0261623    17.90   0.000     .4168377    .5198073
                       675  |   .4734955   .0262817    18.02   0.000     .4217756    .5252154
                       676  |   .4775403   .0263733    18.11   0.000     .4256403    .5294404
                       677  |   .4803146   .0264743    18.14   0.000     .4282158    .5324135
                       678  |   .4828076   .0265015    18.22   0.000     .4306552      .53496
                       679  |   .4856346   .0265486    18.29   0.000     .4333895    .5378797
                       680  |   .4894871   .0266371    18.38   0.000     .4370678    .5419064
                       681  |   .4943566    .026656    18.55   0.000     .4419001    .5468131
                       682  |   .5006458   .0266579    18.78   0.000     .4481855     .553106
                       683  |   .5071422   .0266936    19.00   0.000     .4546118    .5596726
                       684  |    .513445   .0267216    19.21   0.000     .4608594    .5660305
                       685  |   .5179301   .0267702    19.35   0.000      .465249    .5706113
                       686  |   .5212466   .0268511    19.41   0.000     .4684063    .5740869
                       687  |    .524382   .0269464    19.46   0.000     .4713541    .5774099
                       688  |   .5275537   .0270218    19.52   0.000     .4743775      .58073
                       689  |   .5305481   .0271224    19.56   0.000     .4771739    .5839223
                       690  |   .5334315   .0272126    19.60   0.000     .4798797    .5869833
                       691  |   .5365532   .0272832    19.67   0.000     .4828625    .5902439
                       692  |    .540479   .0273955    19.73   0.000     .4865673    .5943907
                       693  |   .5448118   .0274385    19.86   0.000     .4908155    .5988081
                       694  |   .5481149   .0275082    19.93   0.000     .4939815    .6022483
                       695  |   .5506851   .0276268    19.93   0.000     .4963181     .605052
                       696  |   .5526603   .0277566    19.91   0.000      .498038    .6072825
                            |
                      _cons |   11.20689   .0210529   532.32   0.000     11.16546    11.24832
----------------------------+----------------------------------------------------------------
                 regionname |   absorbed                                     (301 categories)
(note: file ../output/wind_farm_event_month.png not found)
(file ../output/wind_farm_event_month.png written in PNG format)

Linear regression, absorbing indicators         Number of obs     =     22,159
                                                F( 101,    300)   =      18.26
                                                Prob > F          =     0.0000
                                                R-squared         =     0.9167
                                                Adj R-squared     =     0.9151
                                                Root MSE          =     0.1391

                                        (Std. Err. adjusted for 301 clusters in regionname)
-------------------------------------------------------------------------------------------
                          |               Robust
                     ln_p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------------+----------------------------------------------------------------
relative_ev_qtr_reggroups |
                       0  |   .0107359   .0124103     0.87   0.388    -.0136863    .0351581
                       1  |   .0009317   .0059864     0.16   0.876    -.0108489    .0127123
                       2  |  -.0017144   .0051003    -0.34   0.737    -.0117513    .0083224
                       3  |  -.0023002   .0041754    -0.55   0.582    -.0105169    .0059165
                       4  |  -.0028047   .0030846    -0.91   0.364     -.008875    .0032656
                       5  |  -.0026117   .0018728    -1.39   0.164    -.0062973    .0010738
                       7  |   .0012292   .0017362     0.71   0.480    -.0021876    .0046459
                       8  |   .0019835   .0032725     0.61   0.545    -.0044565    .0084234
                       9  |   .0018182   .0045006     0.40   0.687    -.0070386     .010675
                      10  |   .0041022   .0055892     0.73   0.464    -.0068969    .0151012
                      11  |    .005436   .0067478     0.81   0.421     -.007843    .0187149
                      12  |   .0068767   .0076303     0.90   0.368    -.0081389    .0218923
                      13  |   .0084964   .0085611     0.99   0.322    -.0083509    .0253438
                    1000  |    .004812   .0138424     0.35   0.728    -.0224285    .0320526
                          |
                      qtr |
                     146  |   .0005841   .0026654     0.22   0.827    -.0046612    .0058294
                     147  |   .0034322   .0038582     0.89   0.374    -.0041605    .0110248
                     148  |   .0157781   .0059656     2.64   0.009     .0040383    .0275178
                     149  |   .0216554   .0066478     3.26   0.001     .0085732    .0347375
                     150  |   .0300858   .0078411     3.84   0.000     .0146552    .0455164
                     151  |   .0375486   .0085043     4.42   0.000     .0208129    .0542843
                     152  |    .047779   .0095191     5.02   0.000     .0290464    .0665116
                     153  |   .0547934   .0101873     5.38   0.000     .0347458     .074841
                     154  |   .0629659   .0108037     5.83   0.000     .0417053    .0842264
                     155  |   .0748155    .011314     6.61   0.000     .0525506    .0970803
                     156  |   .0883857   .0117654     7.51   0.000     .0652325    .1115389
                     157  |   .1045504   .0126375     8.27   0.000      .079681    .1294198
                     158  |   .1152008    .013239     8.70   0.000     .0891478    .1412539
                     159  |   .1247712   .0133936     9.32   0.000     .0984138    .1511285
                     160  |   .1339442   .0136491     9.81   0.000     .1070842    .1608043
                     161  |   .1468234   .0138924    10.57   0.000     .1194845    .1741623
                     162  |   .1574005   .0140208    11.23   0.000      .129809     .184992
                     163  |   .1675137   .0142364    11.77   0.000     .1394978    .1955296
                     164  |   .1833169     .01462    12.54   0.000     .1545461    .2120878
                     165  |   .2000336   .0151797    13.18   0.000     .1701614    .2299057
                     166  |   .2136538   .0157225    13.59   0.000     .1827135    .2445941
                     167  |   .2262577    .016233    13.94   0.000     .1943128    .2582026
                     168  |   .2373823    .016617    14.29   0.000     .2046816     .270083
                     169  |   .2458817   .0167959    14.64   0.000     .2128291    .2789344
                     170  |   .2560522   .0173049    14.80   0.000     .2219979    .2901065
                     171  |   .2678192   .0177665    15.07   0.000     .2328564    .3027819
                     172  |   .2792242   .0182861    15.27   0.000     .2432388    .3152096
                     173  |   .2924346   .0186903    15.65   0.000     .2556538    .3292154
                     174  |   .3076546   .0191631    16.05   0.000     .2699435    .3453657
                     175  |   .3236032   .0197401    16.39   0.000     .2847566    .3624498
                     176  |   .3393844   .0205218    16.54   0.000     .2989996    .3797693
                     177  |   .3590612   .0213587    16.81   0.000     .3170295     .401093
                     178  |   .3799748   .0220275    17.25   0.000     .3366269    .4233227
                     179  |   .3994642   .0227476    17.56   0.000      .354699    .4442293
                     180  |   .4193855   .0234794    17.86   0.000     .3731803    .4655906
                     181  |   .4381912   .0241726    18.13   0.000     .3906219    .4857606
                     182  |   .4549201   .0247859    18.35   0.000     .4061439    .5036962
                     183  |   .4687366   .0253395    18.50   0.000      .418871    .5186022
                     184  |   .4772766   .0256827    18.58   0.000     .4267356    .5278177
                     185  |   .4808983   .0259971    18.50   0.000     .4297386     .532058
                     186  |   .4846411   .0260564    18.60   0.000     .4333645    .5359176
                     187  |   .4850496   .0258117    18.79   0.000     .4342548    .5358445
                     188  |    .485993   .0257145    18.90   0.000     .4353894    .5365966
                     189  |   .4827152   .0254886    18.94   0.000     .4325562    .5328743
                     190  |   .4782414   .0251996    18.98   0.000      .428651    .5278317
                     191  |   .4737978   .0247205    19.17   0.000     .4251502    .5224454
                     192  |   .4658072   .0240907    19.34   0.000     .4183991    .5132153
                     193  |   .4557987   .0233112    19.55   0.000     .4099246    .5016728
                     194  |   .4469088   .0224567    19.90   0.000     .4027162    .4911013
                     195  |   .4388004   .0218428    20.09   0.000     .3958159    .4817849
                     196  |   .4333012      .0215    20.15   0.000     .3909913    .4756111
                     197  |   .4224744   .0214224    19.72   0.000     .3803172    .4646315
                     198  |   .4093747   .0216474    18.91   0.000     .3667748    .4519747
                     199  |   .3992962   .0219642    18.18   0.000     .3560727    .4425196
                     200  |   .3883529   .0222912    17.42   0.000     .3444861    .4322197
                     201  |   .3885071   .0226365    17.16   0.000     .3439606    .4330536
                     202  |   .3849505   .0228533    16.84   0.000     .3399774    .4299237
                     203  |    .379878   .0229947    16.52   0.000     .3346267    .4251293
                     204  |   .3732954   .0232469    16.06   0.000     .3275478    .4190431
                     205  |   .3652028   .0233129    15.67   0.000     .3193252    .4110804
                     206  |   .3612921   .0232495    15.54   0.000     .3155395    .4070448
                     207  |    .357361   .0231876    15.41   0.000     .3117301     .402992
                     208  |   .3586356   .0232378    15.43   0.000     .3129059    .4043653
                     209  |   .3608658   .0234629    15.38   0.000      .314693    .4070386
                     210  |   .3639624   .0237442    15.33   0.000     .3172361    .4106887
                     211  |   .3703796   .0238311    15.54   0.000     .3234823     .417277
                     212  |    .377061   .0241554    15.61   0.000     .3295254    .4245965
                     213  |    .384741   .0245256    15.69   0.000     .3364771    .4330049
                     214  |   .3908824    .024915    15.69   0.000     .3418521    .4399127
                     215  |   .3938186   .0252305    15.61   0.000     .3441673    .4434698
                     216  |   .4000878    .025403    15.75   0.000     .3500971    .4500784
                     217  |   .4058076   .0256275    15.83   0.000     .3553751    .4562402
                     218  |   .4158354    .025896    16.06   0.000     .3648745    .4667963
                     219  |   .4226158   .0262765    16.08   0.000     .3709062    .4743254
                     220  |   .4314813   .0264911    16.29   0.000     .3793494    .4836132
                     221  |   .4400065   .0266584    16.51   0.000     .3875454    .4924676
                     222  |   .4505877   .0268367    16.79   0.000     .3977756    .5033999
                     223  |   .4585596   .0270116    16.98   0.000     .4054034    .5117158
                     224  |   .4668658   .0272435    17.14   0.000     .4132533    .5204783
                     225  |   .4802258   .0275436    17.44   0.000     .4260227    .5344289
                     226  |    .488757   .0276445    17.68   0.000     .4343553    .5431587
                     227  |   .5033823      .0277    18.17   0.000     .4488715    .5578932
                     228  |   .5201344   .0278053    18.71   0.000     .4654162    .5748525
                     229  |   .5300958   .0281132    18.86   0.000     .4747717    .5854198
                     230  |   .5394229   .0283634    19.02   0.000     .4836064    .5952394
                     231  |   .5504672   .0285895    19.25   0.000     .4942058    .6067286
                     232  |   .5552721   .0289042    19.21   0.000     .4983914    .6121529
                          |
                    _cons |   11.20362   .0217831   514.33   0.000     11.16075    11.24648
--------------------------+----------------------------------------------------------------
               regionname |   absorbed                                     (301 categories)
(note: file ../output/wind_farm_event_qtr.png not found)
(file ../output/wind_farm_event_qtr.png written in PNG format)

. 
end of do-file

 make.py ended: 2018-03-12 16:41:23
