
 make.py started: 2018-03-26 13:14:25 C:\Users\giamb\Documents\GitHub\blowin_wind\analysis\descriptive_plots\code 




Execute:  StataSE-64 /e do "./analysis.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./analysis.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     local keep_every 1
  2.     
.     plot_annual_new_turbines
  3.     
.     use "${GoogleDrive}/stata/build_wind_panel/wind_panel_zip_median_listing_sqft.dta", clear
  4.     gen ln_p = log(p)
  5.     label var ln_p "Median listing price per sqft (Log $1,000)"
  6. 
.     plot_prices_ts
  7.     
.     build_zillow_histogram if p <= 1000
  8.     build_zillow_cdf if p <= 1000, keep_every(`keep_every')
  9. end

. 
. program plot_annual_new_turbines
  1.     use "${GoogleDrive}/stata/build_wind_panel/new_turbines_zip.dta", clear
  2.     
.     keep if year >= 1998 & year <= 2017
  3.     collapse (count) objectid_1, by(year)
  4. 
.     graph bar (asis) objectid_1, over(year, label(angle(45) labsize(small))) ///
>         ytitle("Annual installed turbines")
  5.     graph export "../output/annual_new_turbines.png", replace
  6. end

. 
. program plot_prices_ts
  1.     preserve
  2.         bys regionname (dt): egen ever_wind_farm = max(wind_farm)
  3.         collapse (mean) ln_p, by(ever_wind_farm dt)
  4.         tsset ever_wind_farm dt
  5.         
.         label var ln_p "Median listing price per sqft (Log $1,000)"
  6.         sum dt
  7.         
.         graph twoway (tsline ln_p if ever_wind_farm == 0, lpattern(dash) lcolor(gs3))  ///
>             (tsline ln_p if ever_wind_farm == 1, lcolor(gs3)), ytitle(`: var label p') ///
>             xtitle("") xlabel(`r(min)'(50)`r(max)', format(%tmMon-CCYY) labsize(3) angle(45))  ///
>             legend(label(1 "No wind farm") label(2 "Wind farm"))
  8.         graph export "../output/prices_ts.png", replace
  9.     restore
 10. end

. 
. program build_zillow_histogram
  1.     syntax [if]
  2. 
.     histogram ln_p `if', percent
  3.     graph export "../output/hist_zillow_prices.png", replace
  4. end

. 
. program build_zillow_cdf
  1.     syntax [if], keep_every(int)
  2. 
.     preserve
  3.         cumul ln_p `if', gen(c_prices)
  4.         label var c_prices "Cumulative probability"
  5.         sort c_prices
  6.         keep if _n == 1 | mod(_n, `keep_every') == 0
  7.         line c_prices ln_p `if'
  8.         graph export "../output/cdf_zillow_prices.png", replace
  9.     restore
 10. end

. 
. * Execute
. main
(109 observations deleted)
(note: file ../output/annual_new_turbines.png not found)
(file ../output/annual_new_turbines.png written in PNG format)
       panel variable:  ever_wind_farm (strongly balanced)
        time variable:  dt, 2010m1 to 2018m1
                delta:  1 month

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          dt |        194         648    28.07245        600        696
variable p not found
(note: file ../output/prices_ts.png not found)
(file ../output/prices_ts.png written in PNG format)
(bin=58, start=2.8654757, width=.06969448)
(note: file ../output/hist_zillow_prices.png not found)
(file ../output/hist_zillow_prices.png written in PNG format)
(0 observations deleted)
(note: file ../output/cdf_zillow_prices.png not found)
(file ../output/cdf_zillow_prices.png written in PNG format)

. 
end of do-file


Execute:  StataSE-64 /e do "./energy_figures.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./energy_figures.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     import excel "${GoogleDrive}/raw_data/energy_data/Wind energy capacity_American Wind Energy Association.xls", ///
>         sheet("Foglio1") firstrow
  2. 
.     graph bar (asis) cumulativecapacityMW,                  ///
>         over(year, label(labsize(small)))                   ///
>         ytitle("Cumulative Wind Power Capacity (MW)")       ///
>         note("Source: American Wind Energy Association", span)
  3.     graph export "../output/WindEnergyTrend.png", replace
  4. 
.     import excel "${GoogleDrive}/raw_data/energy_data/Wind energy capacity_American Wind Energy Association.xls", ///
>         sheet("Foglio2") firstrow clear
  5.     
.     foreach v of varlist A-Z{
  6.             local x : variable label `v'
  7.             local q`v' = strtoname("`x'")
  8.             ren `v' `q`v''
  9.     }
 10. 
.     gen world=1
 11.     reshape long _, i(world) j(year)
 12.     rename _ energy_cons
 13. 
.     graph bar (asis) energy_cons, over(year, label(angle(45) labsize(small)))       ///
>         ytitle("World Energy Consumption (Mtoe)") ylabel(5000(5000)15000) exclude0  ///
>         note("Source: Global Energy Statistical Yearbook 2016", span)
 14.     graph export "../output/WorldEnergyConsumption.png", replace
 15. end

. 
. * Execute
. main
(note: file ../output/WindEnergyTrend.png not found)
(file ../output/WindEnergyTrend.png written in PNG format)
(note: j = 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                        1   ->      26
Number of variables                  27   ->       3
j variable (26 values)                    ->   year
xij variables:
                  _1990 _1991 ... _2015   ->   _
-----------------------------------------------------------------------------
(note: file ../output/WorldEnergyConsumption.png not found)
(file ../output/WorldEnergyConsumption.png written in PNG format)

. 
end of do-file

 make.py ended: 2018-03-26 13:14:45
