
 make.py started: 2018-03-09 16:39:19 C:\Users\giamb\Documents\GitHub\blowin_wind\analysis\descriptive_regressions\code 




Execute:  StataSE-64 /e do "./analysis.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./analysis.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     local table_file "../output/tables.txt"
  2.     local cluster_vars "regionname dt"
  3.     
.     build_descriptive_table, tables_file(`table_file') ///
>         cluster(`cluster_vars')
  4. end

. 
. program build_descriptive_table
  1.     syntax, tables_file(str) [*]
  2. 
.     local endog = "wind_farm"
  3.     local instr = "wind_zip_area_ratio"
  4. 
.     local obs    = "e(N_clust1) \ e(N)"
  5.     local ss_est = "_b[`endog'] \ _se[`endog']"
  6.     local fs_est = "_b[`instr'] \ _se[`instr']"
  7. 
.     use "${GoogleDrive}/stata/wind_prices_turbines.dta", clear
  8.     
.     reghdfe `endog' `instr', absorb(dt) `options'
  9.     matrix fs_col = (`fs_est' \ `obs')
 10.     matrix fs_table = fs_col
 11.     matrix_to_txt, saving(`tables_file') mat(fs_table) ///
>         format(%20.5f) title(<tab:descr_fs>) replace
 12. 
.     reghdfe D.p `endog', absorb(dt) `options'
 13.     matrix ols_col = (`ss_est' \ `obs')
 14.     reghdfe D.p (`endog' = `instr'), absorb(dt) `options'
 15.     matrix tsls_col = (`ss_est' \ `obs')
 16.     matrix iv_table = (ols_col, tsls_col)
 17.     matrix_to_txt, saving(`tables_file') mat(iv_table) ///
>         format(%20.5f) title(<tab:descr_iv>) append
 18. end

. 
. * Execute
. main
(converged in 1 iterations)

HDFE Linear regression                            Number of obs   =  3,689,222
Absorbing 1 HDFE group                            F(   1,    261) =      99.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0223
                                                  Adj R-squared   =     0.0222
Number of clusters (regionname) =     14,081      Within R-sq.    =     0.0147
Number of clusters (dt)      =        262         Root MSE        =     0.0810

                               (Std. Err. adjusted for 262 clusters in regionname dt)
-------------------------------------------------------------------------------------
                    |               Robust
          wind_farm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
wind_zip_area_ratio |   .0003439   .0000345     9.97   0.000      .000276    .0004117
-------------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------------+
        Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
--------------------+-------------------------------------------------|
                 dt |            0             262            262 *   | 
----------------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(note: file ../output/tables.txt not found)
(converged in 1 iterations)

HDFE Linear regression                            Number of obs   =  3,309,320
Absorbing 1 HDFE group                            F(   1,    260) =      42.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1195
                                                  Adj R-squared   =     0.1195
Number of clusters (regionname) =     14,081      Within R-sq.    =     0.0001
Number of clusters (dt)      =        261         Root MSE        =  2590.9234

                        (Std. Err. adjusted for 261 clusters in regionname dt)
------------------------------------------------------------------------------
             |               Robust
         D.p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   wind_farm |   -290.248   44.45721    -6.53   0.000    -377.7901    -202.706
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
 Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-------------+-------------------------------------------------|
          dt |            0             261            261 *   | 
---------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(converged in 1 iterations)

HDFE IV (2SLS) estimation
-------------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on regionname and dt

Number of clusters (regionname) =  14081              Number of obs =  3309320
Number of clusters (dt) =          261                F(  1,   260) =    39.27
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2.22153e+13                Centered R2   =  -0.1432
Total (uncentered) SS   =  2.22153e+13                Uncentered R2 =        .
Residual SS             =  2.88429e+13                Root MSE      =     2952

------------------------------------------------------------------------------
             |               Robust
         D.p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   wind_farm |  -17166.32   2739.329    -6.27   0.000    -22560.42   -11772.22
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             68.797
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              5.5e+04
                         (Kleibergen-Paap rk Wald F statistic):        106.184
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         wind_farm
Excluded instruments: wind_zip_area_ratio
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
 Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-------------+-------------------------------------------------|
          dt |            0             261            261 *   | 
---------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation

. 
end of do-file

 make.py ended: 2018-03-09 16:44:15
