
 make.py started: 2018-03-09 15:33:52 C:\Users\giamb\Documents\GitHub\blowin_wind\analysis\descriptive_regressions\code 




Execute:  StataSE-64 /e do "./preclean.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./preclean.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     build_wind
  2.     build_zillow
  3.     build_wind_farms
  4. end

. 
. program build_wind
  1.     import delimited "${GoogleDrive}/gis_derived/intersect_wind_zip.csv", clear
  2.     save "../temp/intersect_wind_zip.dta", replace
  3.     
.     import delimited "${GoogleDrive}/gis_derived/zip_area.csv", clear
  4.     merge 1:m zcta5ce10 using "../temp/intersect_wind_zip.dta", ///
>         keepusing(a30_ratio area_intersect) keep(3) assert(1 3) nogen
  5.         
.     bys zcta5ce10: egen validate_area = total(area_intersect)
  6.     assert ((validate_area - area_zip)/area_zip < 0.001)
  7.     drop validate_area
  8.     
.     gen w_area_intersect = a30_ratio*area_intersect
  9.     collapse area_zip (sum) tot_w_wind_zip = w_area_intersect, by(zcta5ce10)
 10.     gen wind_zip_area_ratio = (tot_w_wind_zip / area_zip)*100
 11.     gen regionname = zcta5ce10
 12.     drop if wind_zip_area_ratio > 100
 13.     
.     save "../temp/wind_zip_area_ratio.dta", replace
 14.     
.     replace wind_zip_area_ratio = round(wind_zip_area_ratio, .001)
 15.     export delimited using "${GoogleDrive}/stata/zip_wind_weighted.csv", replace
 16. end

. 
. program build_zillow
  1.     import delimited "${GoogleDrive}/raw_data/zillow/prices/Zip_Zhvi_AllHomes.csv", clear
  2.     
.     foreach v of varlist v8-v269 {
  3.         local x: variable label `v'
  4.         local x: subinstr local x "-" "m"
  5.         local x p`x'
  6.         rename `v' `x'
  7.     }
  8.     save "../temp/zillow_prices.dta", replace
  9.     
.     import delimited "${GoogleDrive}/gis_derived/zip_area.csv", ///
>         stringcol(1) clear
 10.     destring zcta5ce10, gen(regionname)
 11.     keep zcta5ce10 regionname
 12.     
.     merge 1:1 regionname using "../temp/zillow_prices.dta", keep(3) assert(1 2 3) nogen
 13.     keep zcta5ce10 p2007m01
 14.     
.     export delimited using "${GoogleDrive}/stata/zillow_zip.csv", replace
 15. end

. 
. program build_wind_farms
  1.     import delimited "${GoogleDrive}/gis_derived/zip_turbines.csv", clear
  2.     keep objectid_1 dtbuilt propdes sprname zcta5ce10
  3.     
.     gen date = date(dtbuilt, "YMDhms")
  4.     gen dt = mofd(date)
  5.     format dt %tm
  6.     generate year=year(date)
  7.     keep if year > 1930 & year < 5000
  8.     
.     drop if sprname == ""
  9.     bys sprname: gen nbr_turbines_by_prj = _N
 10.     keep if nbr_turbines_by_prj >= 10
 11.     bys zcta5ce10 dt: gen new_turbines_zip_month = _N
 12.     
.     additional_turbines_plot
 13.     
.     egen t = tag(zcta5ce10 dt)
 14.     keep if t == 1
 15.     keep zcta5ce10 new_turbines_zip_month dt
 16.     bys zcta5ce10 (dt): gen aggr_turb_zip_month = sum(new_turbines_zip_month)
 17.     rename zcta5ce10 regionname
 18.     save "../temp/turbines_zip.dta", replace
 19.     
.     use "../temp/zillow_prices.dta", clear
 20.     reshape long p, i(regionname) j(date, string)
 21.     gen dt = monthly(date,"YM")
 22.     format dt %tm
 23.     
.     merge 1:1 regionname dt using "../temp/turbines_zip.dta", ///
>         assert(1 2 3) keep(1 3)
 24.     gen wind_farm = 1 if _merge == 3
 25.     drop _merge
 26.     
.     bysort regionname (dt): carryforward aggr_turb_zip_month wind_farm, replace
 27.     foreach var in new_turbines_zip_month aggr_turb_zip_month wind_farm {
 28.         replace `var' = 0 if `var' == .
 29.     }
 30.     
.     merge m:1 regionname using "../temp/wind_zip_area_ratio.dta", ///
>         nogen assert(1 2 3) keep(3)
 31.         
.     xtset regionname dt
 32.     save "../temp/wind_prices_turbines.dta", replace
 33. end

. 
. program additional_turbines_plot
  1.     preserve
  2.         keep if year >= 1998 & year <= 2017
  3.         collapse (count) objectid_1, by(year)
  4. 
.         graph bar (asis) objectid_1, over(year, label(angle(45) labsize(small))) ///
>             ytitle("Annual installed turbines") exclude0
  5.         graph export "../output/annual_new_turbines.png", replace
  6.     restore
  7. end

. 
. * Execute
. main
(5 vars, 107,680 obs)
(note: file ../temp/intersect_wind_zip.dta not found)
file ../temp/intersect_wind_zip.dta saved
(6 vars, 33,144 obs)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           107,680  
    -----------------------------------------
(29 observations deleted)
(note: file ../temp/wind_zip_area_ratio.dta not found)
file ../temp/wind_zip_area_ratio.dta saved
(24,196 real changes made)
file G:/My Drive/research projects/wind/stata/zip_wind_weighted.csv saved
(269 vars, 15,327 obs)
(note: file ../temp/zillow_prices.dta not found)
file ../temp/zillow_prices.dta saved
(6 vars, 33,144 obs)
zcta5ce10: all characters numeric; regionname generated as long

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            15,311  
    -----------------------------------------
file G:/My Drive/research projects/wind/stata/zillow_zip.csv saved
(74 vars, 47,761 obs)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(3 observations deleted)
(28 observations deleted)
(1,800 observations deleted)
(87 observations deleted)
(note: file ../output/annual_new_turbines.png not found)
(file ../output/annual_new_turbines.png written in PNG format)
(41,824 observations deleted)
(note: file ../temp/turbines_zip.dta not found)
file ../temp/turbines_zip.dta saved
(note: j = 1996m04 1996m05 1996m06 1996m07 1996m08 1996m09 1996m10 1996m11 1996m12 1997m01 1997m02 1997m03 1997m04 1997m05 1997m06 1997m07 1997m08 1997m09 1997m10 1997m11 1997m12 1998m01 1998m02 1998m03 1998m04 1998m05 1998m06 1998m07 1998m08 1998m09 1998
> m10 1998m11 1998m12 1999m01 1999m02 1999m03 1999m04 1999m05 1999m06 1999m07 1999m08 1999m09 1999m10 1999m11 1999m12 2000m01 2000m02 2000m03 2000m04 2000m05 2000m06 2000m07 2000m08 2000m09 2000m10 2000m11 2000m12 2001m01 2001m02 2001m03 2001m04 2001m05 2
> 001m06 2001m07 2001m08 2001m09 2001m10 2001m11 2001m12 2002m01 2002m02 2002m03 2002m04 2002m05 2002m06 2002m07 2002m08 2002m09 2002m10 2002m11 2002m12 2003m01 2003m02 2003m03 2003m04 2003m05 2003m06 2003m07 2003m08 2003m09 2003m10 2003m11 2003m12 2004m0
> 1 2004m02 2004m03 2004m04 2004m05 2004m06 2004m07 2004m08 2004m09 2004m10 2004m11 2004m12 2005m01 2005m02 2005m03 2005m04 2005m05 2005m06 2005m07 2005m08 2005m09 2005m10 2005m11 2005m12 2006m01 2006m02 2006m03 2006m04 2006m05 2006m06 2006m07 2006m08 200
> 6m09 2006m10 2006m11 2006m12 2007m01 2007m02 2007m03 2007m04 2007m05 2007m06 2007m07 2007m08 2007m09 2007m10 2007m11 2007m12 2008m01 2008m02 2008m03 2008m04 2008m05 2008m06 2008m07 2008m08 2008m09 2008m10 2008m11 2008m12 2009m01 2009m02 2009m03 2009m04 
> 2009m05 2009m06 2009m07 2009m08 2009m09 2009m10 2009m11 2009m12 2010m01 2010m02 2010m03 2010m04 2010m05 2010m06 2010m07 2010m08 2010m09 2010m10 2010m11 2010m12 2011m01 2011m02 2011m03 2011m04 2011m05 2011m06 2011m07 2011m08 2011m09 2011m10 2011m11 2011m
> 12 2012m01 2012m02 2012m03 2012m04 2012m05 2012m06 2012m07 2012m08 2012m09 2012m10 2012m11 2012m12 2013m01 2013m02 2013m03 2013m04 2013m05 2013m06 2013m07 2013m08 2013m09 2013m10 2013m11 2013m12 2014m01 2014m02 2014m03 2014m04 2014m05 2014m06 2014m07 20
> 14m08 2014m09 2014m10 2014m11 2014m12 2015m01 2015m02 2015m03 2015m04 2015m05 2015m06 2015m07 2015m08 2015m09 2015m10 2015m11 2015m12 2016m01 2016m02 2016m03 2016m04 2016m05 2016m06 2016m07 2016m08 2016m09 2016m10 2016m11 2016m12 2017m01 2017m02 2017m03
>  2017m04 2017m05 2017m06 2017m07 2017m08 2017m09 2017m10 2017m11 2017m12 2018m01)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    15327   -> 4.0e+06
Number of variables                 269   ->       9
j variable (262 values)                   ->   date
xij variables:
         p1996m04 p1996m05 ... p2018m01   ->   p
-----------------------------------------------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     4,014,461
        from master                 4,014,461  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,213  (_merge==3)
    -----------------------------------------
(4,014,461 missing values generated)
aggr_turb_zip_month:  (24,467 real changes made)
wind_farm:  (24,467 real changes made)
(4,014,461 real changes made)
(3,989,994 real changes made)
(3,989,994 real changes made)
(note: variable regionname was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         3,689,222  
    -----------------------------------------
       panel variable:  regionname (strongly balanced)
        time variable:  dt, 1996m4 to 2018m1
                delta:  1 month
(note: file ../temp/wind_prices_turbines.dta not found)
file ../temp/wind_prices_turbines.dta saved

. 
end of do-file


Execute:  StataSE-64 /e do "./analysis.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./analysis.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries

. 
. program main
  1.     local table_file "../output/tables.txt"
  2.     local cluster_vars "regionname dt"
  3.     
.     build_descriptive_table, tables_file(`table_file') ///
>         cluster(`cluster_vars')
  4. end

. 
. program build_descriptive_table
  1.     syntax, tables_file(str) [*]
  2. 
.     local endog = "wind_farm"
  3.     local instr = "wind_zip_area_ratio"
  4. 
.     local obs    = "e(N_clust1) \ e(N)"
  5.     local ss_est = "_b[`endog'] \ _se[`endog']"
  6.     local fs_est = "_b[`instr'] \ _se[`instr']"
  7. 
.     use "../temp/wind_prices_turbines.dta", clear
  8.     
.     reghdfe `endog' `instr', absorb(dt) `options'
  9.     matrix fs_col = (`fs_est' \ `obs')
 10.     matrix fs_table = fs_col
 11.     matrix_to_txt, saving(`tables_file') mat(fs_table) ///
>         format(%20.5f) title(<tab:descr_fs>) replace
 12. 
.     reghdfe D.p `endog', absorb(dt) `options'
 13.     matrix ols_col = (`ss_est' \ `obs')
 14.     reghdfe D.p (`endog' = `instr'), absorb(dt) `options'
 15.     matrix tsls_col = (`ss_est' \ `obs')
 16.     matrix iv_table = (ols_col, tsls_col)
 17.     matrix_to_txt, saving(`tables_file') mat(iv_table) ///
>         format(%20.5f) title(<tab:descr_iv>) append
 18. end

. 
. * Execute
. main
(converged in 1 iterations)

HDFE Linear regression                            Number of obs   =  3,689,222
Absorbing 1 HDFE group                            F(   1,    261) =      99.49
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.0223
                                                  Adj R-squared   =     0.0222
Number of clusters (regionname) =     14,081      Within R-sq.    =     0.0147
Number of clusters (dt)      =        262         Root MSE        =     0.0810

                               (Std. Err. adjusted for 262 clusters in regionname dt)
-------------------------------------------------------------------------------------
                    |               Robust
          wind_farm |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
--------------------+----------------------------------------------------------------
wind_zip_area_ratio |   .0003439   .0000345     9.97   0.000      .000276    .0004117
-------------------------------------------------------------------------------------

Absorbed degrees of freedom:
----------------------------------------------------------------------+
        Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
--------------------+-------------------------------------------------|
                 dt |            0             262            262 *   | 
----------------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(note: file ../output/tables.txt not found)
(converged in 1 iterations)

HDFE Linear regression                            Number of obs   =  3,309,320
Absorbing 1 HDFE group                            F(   1,    260) =      42.62
Statistics robust to heteroskedasticity           Prob > F        =     0.0000
                                                  R-squared       =     0.1195
                                                  Adj R-squared   =     0.1195
Number of clusters (regionname) =     14,081      Within R-sq.    =     0.0001
Number of clusters (dt)      =        261         Root MSE        =  2590.9234

                        (Std. Err. adjusted for 261 clusters in regionname dt)
------------------------------------------------------------------------------
             |               Robust
         D.p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   wind_farm |   -290.248   44.45721    -6.53   0.000    -377.7901    -202.706
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
 Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-------------+-------------------------------------------------|
          dt |            0             261            261 *   | 
---------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation
(converged in 1 iterations)

HDFE IV (2SLS) estimation
-------------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity and clustering on regionname and dt

Number of clusters (regionname) =  14081              Number of obs =  3309320
Number of clusters (dt) =          261                F(  1,   260) =    39.27
                                                      Prob > F      =   0.0000
Total (centered) SS     =  2.22153e+13                Centered R2   =  -0.1432
Total (uncentered) SS   =  2.22153e+13                Uncentered R2 =        .
Residual SS             =  2.88429e+13                Root MSE      =     2952

------------------------------------------------------------------------------
             |               Robust
         D.p |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   wind_farm |  -17166.32   2739.329    -6.27   0.000    -22560.42   -11772.22
------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             68.797
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              5.5e+04
                         (Kleibergen-Paap rk Wald F statistic):        106.184
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         wind_farm
Excluded instruments: wind_zip_area_ratio
------------------------------------------------------------------------------

Absorbed degrees of freedom:
---------------------------------------------------------------+
 Absorbed FE |  Num. Coefs.  =   Categories  -   Redundant     | 
-------------+-------------------------------------------------|
          dt |            0             261            261 *   | 
---------------------------------------------------------------+
* = fixed effect nested within cluster; treated as redundant for DoF computation

. 
end of do-file

 make.py ended: 2018-03-09 15:44:28
