
 make.py started: 2018-03-12 11:36:12 C:\Users\giamb\Documents\GitHub\blowin_wind\derived_local\build_wind_prices_turbines_panel\code 




Execute:  StataSE-64 /e do "./build_controls.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build_controls.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     buil_geo_controls
  2.     
.     use p0030001 p0030002 p0030003 p0030005 zcta5 using /// 
>         "${GoogleDrive}/raw_data/zip_controls/census_2010_sf1/sf12010860us3.dta", clear
  3.     
.     destring zcta5, gen(regionname)
  4.     rename (p0030001 p0030002 p0030003 p0030005) ///
>         (pop white_pop black_pop asian_pop)
  5. 
.     gen white_ratio = white_pop / pop
  6.     gen black_ratio = black_pop / pop
  7.     gen asian_ratio = asian_pop / pop
  8.     keep regionname pop white_ratio black_ratio asian_ratio
  9. 
.     save_data "../temp/pop_controls.dta", key(regionname) replace
 10.     
.     use p0120001 p0120002 zcta5 using ///
>         "${GoogleDrive}/raw_data/zip_controls/census_2010_sf1/sf12010860us4.dta", clear
 11.     
.     destring zcta5, gen(regionname)
 12.     rename (p0120001 p0120002) (pop male)
 13.     
.     gen male_ratio = male / pop
 14.     keep regionname male_ratio
 15.     
.     merge 1:1 regionname using "../temp/pop_controls.dta", ///
>         nogen assert(3) keep(3)
 16.     save_data "../temp/pop_controls.dta", key(regionname) replace
 17.     
.     build_zip_zcta_xwalk
 18. 
.     * Using income control we loose zipcodes. Need to look into this
.     import delimited "${GoogleDrive}/raw_data/zip_controls/soi_tax/10zpallagi.csv", clear
 19.     keep zipcode n1 a00100
 20.     
.     destring zipcode, replace
 21.     keep if zipcode != 0    
 22.     rename (n1 a00100) (returns adj_gr_income)
 23.     
.     collapse (sum) returns adj_gr_income, by(zipcode)
 24.     gen avg_income = adj_gr_income / returns
 25.     merge 1:1 zipcode using "../temp/zip_zcta_xwalk.dta", ///
>         nogen keep(3) assert(1 2 3)
 26.     
.     merge 1:1 regionname using "../temp/pop_controls.dta", ///
>         nogen assert(2 3) keep(3)
 27.     merge 1:1 regionname using "../temp/zipcode_geo_controls.dta", ///
>         nogen assert(1 2 3) keep(3)
 28.     save_data "../temp/zip_controls.dta", key(regionname) replace
 29. end

. 
. program buil_geo_controls
  1.     * Need to derive these from raw data again
.     import delimited "G:\My Drive\brown\labor\project\wind\data\output\DistanceFromCoast.txt", clear
  2.     rename zip_code regionname
  3.     keep regionname near_dist
  4.     replace near_dist = near_dist / 1000
  5. 
.     save_data "../temp/zipcode_geo_controls.dta", replace key(regionname)
  6. 
.     import delimited "G:\My Drive\brown\labor\project\wind\data\output\Elevation.txt", clear
  7.     keep zip_code rastervalu
  8.     rename (zip_code rastervalu) (regionname elevation)
  9.     drop if elevation == -9999
 10. 
.     merge 1:1 regionname using "../temp/zipcode_geo_controls.dta", ///
>         nogen keep(3) assert(3)
 11.     save_data "../temp/zipcode_geo_controls.dta", replace key(regionname)
 12. end

. 
. program build_zip_zcta_xwalk
  1.     import excel "${GoogleDrive}/raw_data/zipcode_zcta_xwalk/zip_to_zcta_2017.xlsx", ///
>         sheet("Zip_to_ZCTA_2016") firstrow clear
  2.     
.     destring ZIP_CODE, gen(zipcode)
  3.     destring ZCTA, gen(regionname)
  4.     keep zipcode regionname
  5.     
.     save_data "../temp/zip_zcta_xwalk.dta", key(zipcode) replace
  6. end

. 
. * Execute
. main
(16 vars, 30,541 obs)
(30,541 real changes made)
(data now sorted by regionname)
  (0 bytes saved)
==================================================================================================
File: ../temp/zipcode_geo_controls.dta
Key: regionname
==================================================================================================
  30541:2(96736):2541073023:2924588329

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     30,541    49596.22    27563.81          1      99950
   near_dist |     30,541    288.6336    299.4008   .0020966   5025.376




(note: file ../temp/zipcode_geo_controls.dta not found)
file ../temp/zipcode_geo_controls.dta saved
(17 vars, 30,541 obs)
(250 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            30,291  
    -----------------------------------------
(data already sorted by regionname)
  (0 bytes saved)
==================================================================================================
File: ../temp/zipcode_geo_controls.dta
Key: regionname
==================================================================================================
  30291:3(52049):2246175711:2401438853

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     30,291    49540.31    27433.46          1      99950
   elevation |     30,291    357.4269    436.4413        -69       3709
   near_dist |     30,291    290.2878    294.5177   .0020966   1316.173




file ../temp/zipcode_geo_controls.dta saved
zcta5: all characters numeric; regionname generated as long
(144 missing values generated)
(144 missing values generated)
(144 missing values generated)
(data now sorted by regionname)
  (0 bytes saved)
==================================================================================================
File: ../temp/pop_controls.dta
Key: regionname
==================================================================================================
  33120:5(109971):802685851:2481006444

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     33,120    49666.33    27564.93        601      99929
         pop |     33,120    9434.269    13753.94          0     113916
 white_ratio |     32,976    .8322832    .2067993          0          1
 black_ratio |     32,976    .0765716    .1575173          0          1
 asian_ratio |     32,976    .0191248    .0501845          0          1




(note: file ../temp/pop_controls.dta not found)
file ../temp/pop_controls.dta saved
zcta5: all characters numeric; regionname generated as long
(144 missing values generated)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            33,120  
    -----------------------------------------
(data already sorted by regionname)
  (0 bytes saved)
==================================================================================================
File: ../temp/pop_controls.dta
Key: regionname
==================================================================================================
  33120:6(99766):642207390:3097104632

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     33,120    49666.33    27564.93        601      99929
  male_ratio |     32,976    .5018533    .0445299          0          1
         pop |     33,120    9434.269    13753.94          0     113916
 white_ratio |     32,976    .8322832    .2067993          0          1
 black_ratio |     32,976    .0765716    .1575173          0          1
-------------+---------------------------------------------------------
 asian_ratio |     32,976    .0191248    .0501845          0          1




file ../temp/pop_controls.dta saved
ZIP_CODE: all characters numeric; zipcode generated as long
ZCTA: all characters numeric; regionname generated as long
(data now sorted by zipcode)
  (0 bytes saved)
==================================================================================================
File: ../temp/zip_zcta_xwalk.dta
Key: zipcode
==================================================================================================
  41184:2(122201):1069770470:2172241517

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     zipcode |     41,184    49588.09    27937.71        501      99950
  regionname |     41,184    49555.32    27927.68        601      99929




(note: file ../temp/zip_zcta_xwalk.dta not found)
file ../temp/zip_zcta_xwalk.dta saved
(73 vars, 167,022 obs)
zipcode already numeric; no replace
(306 observations deleted)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            27,781  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            27,781  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            27,511  
    -----------------------------------------
(data already sorted by regionname)
  (0 bytes saved)
==================================================================================================
File: ../temp/zip_controls.dta
Key: regionname
==================================================================================================
  27511:12(57840):2815889337:4162229602

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     27,511    48845.86    26922.72       1001      99835
     zipcode |     27,511    48845.86    26922.72       1001      99835
     returns |     27,511     4945.51     6475.98    87.0003      52607
adj_gr_inc~e |     27,511    289628.5    474298.5       1706   1.17e+07
  avg_income |     27,511    53.17259    38.25005   5.001689   2368.675
-------------+---------------------------------------------------------
  male_ratio |     27,511    .4992528     .029497   .1522716   .9701023
         pop |     27,511    11048.73    14285.47          4     113916
 white_ratio |     27,511    .8326477    .1972321   .0040855          1
 black_ratio |     27,511    .0815186     .159848          0   .9825632
 asian_ratio |     27,511     .020213    .0486299          0   .7158496
-------------+---------------------------------------------------------
   elevation |     27,511    331.3374    397.9725        -69       3631
   near_dist |     27,511    279.3247    286.1438   .0020966   1316.173




(note: file ../temp/zip_controls.dta not found)
file ../temp/zip_controls.dta saved

. 
end of do-file


Execute:  StataSE-64 /e do "./build_wind_panel.do"

  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     Special Edition                  College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

110-user Stata network perpetual license:
       Serial number:  401506201178
         Licensed to:  Brown University
                       Brown University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  Maximum number of variables is set to 5000; see help set_maxvar.

. do ./build_wind_panel.do 

. set more off

. adopath + ../../../lib/stata/gslab_misc/ado
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"

. adopath + ../../../lib/third_party/stata_tools
  [1]  (BASE)      "C:\Program Files (x86)\Stata15\ado\base/"
  [2]  (SITE)      "C:\Program Files (x86)\Stata15\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "c:\ado\personal/"
  [5]  (PLUS)      "c:\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "../../../lib/stata/gslab_misc/ado"
  [8]              "../../../lib/third_party/stata_tools"

. preliminaries, loadglob("../../../lib/python/wind/input_params.txt")

. 
. program main
  1.     build_wind
  2.     build_zillow
  3.     build_wind_farms
  4.     build_wind_panel
  5. end

. 
. program build_wind
  1.     import delimited "${GoogleDrive}/gis_derived/intersect_wind_zip.csv", clear
  2.     save "../temp/intersect_wind_zip.dta", replace
  3.     
.     import delimited "${GoogleDrive}/gis_derived/zip_area.csv", clear
  4.     merge 1:m zcta5ce10 using "../temp/intersect_wind_zip.dta", ///
>         keepusing(a30_ratio area_intersect) keep(3) assert(1 3) nogen
  5.         
.     bys zcta5ce10: egen validate_area = total(area_intersect)
  6.     assert ((validate_area - area_zip)/area_zip < 0.001)
  7.     drop validate_area
  8.     
.     gen w_area_intersect = a30_ratio*area_intersect
  9.     collapse area_zip (sum) tot_w_wind_zip = w_area_intersect, by(zcta5ce10)
 10.     gen wind_zip_area_ratio = (tot_w_wind_zip / area_zip)*100
 11.     gen regionname = zcta5ce10
 12.     drop if wind_zip_area_ratio > 100
 13.     
.     save_data "../temp/wind_zip_area_ratio.dta", ///
>         key(regionname) replace
 14.     
.     replace wind_zip_area_ratio = round(wind_zip_area_ratio, .001)
 15.     export delimited using "${GoogleDrive}/stata/zip_wind_weighted.csv", replace
 16. end

. 
. program build_zillow
  1.     import delimited "${GoogleDrive}/raw_data/zillow/prices/Zip_Zhvi_AllHomes.csv", clear
  2.     
.     foreach v of varlist v8-v269 {
  3.         local x: variable label `v'
  4.         local x: subinstr local x "-" "m"
  5.         local x p`x'
  6.         rename `v' `x'
  7.     }
  8.     *rename regionname zipcode
.     *merge 1:1 zipcode using "../temp/zip_zcta_xwalk.dta", ///
>     *    nogen keep(3) assert(1 2 3)
.     *drop zipcode
.     save_data "../temp/zillow_prices.dta", key(regionname) replace
  9.     
.     import delimited "${GoogleDrive}/gis_derived/zip_area.csv", ///
>         stringcol(1) clear
 10.     destring zcta5ce10, gen(regionname)
 11.     keep zcta5ce10 regionname
 12.     
.     merge 1:1 regionname using "../temp/zillow_prices.dta", ///
>         keep(3) assert(1 2 3) nogen
 13.     keep zcta5ce10 p2007m01
 14.     
.     export delimited using "${GoogleDrive}/stata/zillow_zip.csv", replace
 15. end

. 
. program build_wind_farms
  1.     import delimited "${GoogleDrive}/gis_derived/zip_turbines.csv", clear
  2.     keep objectid_1 dtbuilt sprname zcta5ce10
  3.     
.     gen date = date(dtbuilt, "YMDhms")
  4.     gen dt = mofd(date)
  5.     format dt %tm
  6.     generate year=year(date)
  7.     keep if year > 1930 & year < 5000
  8.     
.     drop if sprname == ""
  9.     bys sprname: gen nbr_turbines_by_prj = _N
 10.     keep if nbr_turbines_by_prj >= 10
 11.     bys zcta5ce10 dt: gen new_turbines_zip_month = _N
 12.     
.     egen t = tag(zcta5ce10 dt)
 13.     keep if t == 1
 14.     keep zcta5ce10 new_turbines_zip_month dt
 15.     bys zcta5ce10 (dt): gen aggr_turb_zip_month = sum(new_turbines_zip_month)
 16.     rename zcta5ce10 regionname
 17.     save_data "../temp/turbines_zip.dta", key(regionname dt) replace
 18. end

. 
. program build_wind_panel
  1.     use "../temp/zillow_prices.dta", clear
  2.     reshape long p, i(regionname) j(date, string)
  3.     gen dt = monthly(date,"YM")
  4.     format dt %tm
  5.     
.     merge 1:1 regionname dt using "../temp/turbines_zip.dta", ///
>         assert(1 2 3) keep(1 3)
  6.     gen wind_farm = 1 if _merge == 3
  7.     drop _merge
  8.     
.     bysort regionname (dt): carryforward aggr_turb_zip_month wind_farm, replace
  9.     foreach var in new_turbines_zip_month aggr_turb_zip_month wind_farm {
 10.         replace `var' = 0 if `var' == .
 11.     }
 12.     
.     merge m:1 regionname using "../temp/wind_zip_area_ratio.dta", ///
>         nogen assert(1 2 3) keep(3)
 13.     merge m:1 regionname using "../temp/zip_controls.dta", ///
>         nogen assert(1 2 3) keep(3)
 14.         
.     xtset regionname dt
 15.     save_data "${GoogleDrive}/stata/wind_prices_turbines.dta", ///
>         key(regionname dt) replace
 16. end

. 
. * Execute
. main
(5 vars, 107,680 obs)
(note: file ../temp/intersect_wind_zip.dta not found)
file ../temp/intersect_wind_zip.dta saved
(6 vars, 33,144 obs)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           107,680  
    -----------------------------------------
(29 observations deleted)
(data now sorted by regionname)
  (0 bytes saved)
==================================================================================================
File: ../temp/wind_zip_area_ratio.dta
Key: regionname
==================================================================================================
  31151:5(63268):2052719176:3742445314

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     31,151    49213.74    26974.17       1001      99403
   zcta5ce10 |     31,151    49213.74    26974.17       1001      99403
    area_zip |     31,151    221.1758    432.5601     .00271   13476.87
tot_w_wind~p |     31,151    100.9336    277.3686          0   7824.251
wind_zip_a~o |     31,151    33.69854    36.37572          0   99.99874




(note: file ../temp/wind_zip_area_ratio.dta not found)
file ../temp/wind_zip_area_ratio.dta saved
(24,196 real changes made)
file G:/My Drive/research projects/wind/stata/zip_wind_weighted.csv saved
(269 vars, 15,327 obs)
(data now sorted by regionname)
  (0 bytes saved)
==================================================================================================
File: ../temp/zillow_prices.dta
Key: regionname
==================================================================================================
  15327:269(78037):1492192219:432810718

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |     15,327    46266.99     28959.1       1001      99901
    regionid |     15,327    80125.32    30891.37      58196     738092
        city |          0
       state |          0
       metro |          0
-------------+---------------------------------------------------------
  countyname |          0
    sizerank |     15,327        7664    4424.668          1      15327
    p1996m04 |     11,181    117877.1    68747.76      16700    1743500
    p1996m05 |     11,308    117848.9    68516.27      17100    1745200
    p1996m06 |     11,334    117857.9    68548.25      17500    1744300
-------------+---------------------------------------------------------
    p1996m07 |     11,341    117892.6    68623.34      17800    1741300
    p1996m08 |     11,353    117984.7    68664.76      17900    1739700
    p1996m09 |     11,353    118103.1    68752.94      18000    1741300
    p1996m10 |     11,353    118265.7    68881.24      18300    1744500
    p1996m11 |     11,360    118502.3    69038.73      18800    1744600
-------------+---------------------------------------------------------
    p1996m12 |     11,360    118822.1    69276.32      19100    1743600
    p1997m01 |     11,409      119251    69602.73      19400    1744700
    p1997m02 |     12,057    119623.2    72801.98      19900    1747700
    p1997m03 |     12,103    120239.6    73211.22      20300    1751800
    p1997m04 |     12,103    120613.8     73495.9      20700    1755500
-------------+---------------------------------------------------------
    p1997m05 |     12,104    120970.4    73766.56      20800    1757400
    p1997m06 |     12,106    121362.4    74085.28      20600    1758200
    p1997m07 |     12,106    121796.9    74520.48      20400    1759200
    p1997m08 |     12,290    121749.3    74937.03      20300    1760700
    p1997m09 |     12,293    122231.4     75426.1      20200    1762500
-------------+---------------------------------------------------------
    p1997m10 |     12,294    122738.9    75898.95      20400    1764300
    p1997m11 |     12,296    123303.5    76437.98      20600    1767800
    p1997m12 |     12,306    123957.7    77089.04      20700    1772100
    p1998m01 |     12,329      124663     77865.1      20900    1775600
    p1998m02 |     12,576    124992.7    78788.72      21200    1777500
-------------+---------------------------------------------------------
    p1998m03 |     12,577    125671.8    79468.24      21200    1782800
    p1998m04 |     12,586      126204    80006.59      21300    1788100
    p1998m05 |     12,614    126725.5    80534.42      21500    1794400
    p1998m06 |     12,627    127133.6    81104.53      21700    1794900
    p1998m07 |     12,673    127771.3    81708.12      22000    1792600
-------------+---------------------------------------------------------
    p1998m08 |     12,740    128273.3    82200.55      22500    1791400
    p1998m09 |     12,740    128835.9    82821.55      23200    1794100
    p1998m10 |     12,740    129437.6    83485.08      23400    1792500
    p1998m11 |     12,766    130212.3    84276.72      23500    1791900
    p1998m12 |     12,766    130884.2    84918.11      23700    1791700
-------------+---------------------------------------------------------
    p1999m01 |     12,766    131607.7    85565.84      23600    1791900
    p1999m02 |     12,812    132201.9    86156.52      23200    1790900
    p1999m03 |     12,812    132973.8    86825.57      22900    1790700
    p1999m04 |     12,813      133764    87599.33      22800    1790400
    p1999m05 |     12,821    134556.5    88487.17      22900    1791800
-------------+---------------------------------------------------------
    p1999m06 |     12,838    135463.5    89513.38      22900    1796400
    p1999m07 |     12,838    136310.6    90525.77      22900    1800600
    p1999m08 |     12,882    137127.2    91479.39      23000    1800800
    p1999m09 |     12,882      137963    92578.06      22900    1811800
    p1999m10 |     12,882    138833.1    93784.89      22800    1828800
-------------+---------------------------------------------------------
    p1999m11 |     12,882    139766.2    95123.64      23200    1851800
    p1999m12 |     12,882    140760.4    96553.82      23500    1887800
    p2000m01 |     12,882    141858.5    98138.13      23500    1945300
    p2000m02 |     12,918    143036.4    99785.23      23400    2009700
    p2000m03 |     12,918    144165.6    101312.8      23400    2035100
-------------+---------------------------------------------------------
    p2000m04 |     12,918    145233.4    102803.4      23500    2064700
    p2000m05 |     12,921    146363.6    104469.9      23600    2141000
    p2000m06 |     12,921    147488.6      106151      23700    2224800
    p2000m07 |     12,924    148639.2    107861.1      24000    2292300
    p2000m08 |     12,971    149563.9    109427.6      24200    2356400
-------------+---------------------------------------------------------
    p2000m09 |     12,971    150645.6    111008.4      24200    2413300
    p2000m10 |     12,972    151742.8    112553.2      23900    2463000
    p2000m11 |     12,972    152830.1    114069.5      23400    2508600
    p2000m12 |     12,973    153944.7    115449.5      22900    2527400
    p2001m01 |     12,973    155110.4    116733.4      22100    2552900
-------------+---------------------------------------------------------
    p2001m02 |     12,998    156245.7    117923.5      21200    2585200
    p2001m03 |     13,035    157455.4    118822.3      20800    2611500
    p2001m04 |     13,035    158489.9      119566      21000    2596400
    p2001m05 |     13,035    159462.5    120180.6      21500    2570100
    p2001m06 |     13,035    160361.2      120749      21700    2552800
-------------+---------------------------------------------------------
    p2001m07 |     13,035    161222.4    121309.1      21800    2545400
    p2001m08 |     13,061      162047    121869.5      22300    2542600
    p2001m09 |     13,061    162933.4    122507.2      22700    2551600
    p2001m10 |     13,061    163790.4    123129.6      23000    2565700
    p2001m11 |     13,061    164621.2    123741.1      23500    2591900
-------------+---------------------------------------------------------
    p2001m12 |     13,061    165459.5    124342.2      24100    2624100
    p2002m01 |     13,061    166367.6    125018.1      24300    2639000
    p2002m02 |     13,090    167268.9    125770.1      24500    2654300
    p2002m03 |     13,091    168300.4    126767.8      24600    2692900
    p2002m04 |     13,091    169367.8    127887.4      24600    2739400
-------------+---------------------------------------------------------
    p2002m05 |     13,091    170511.7    129145.9      24500    2772400
    p2002m06 |     13,091    171763.4    130574.6      24500    2813900
    p2002m07 |     13,091    173127.5    132102.4      24800    2852400
    p2002m08 |     13,130    174452.9    133464.6      25400    2871900
    p2002m09 |     13,132    175861.8    134807.3      25900    2873300
-------------+---------------------------------------------------------
    p2002m10 |     13,132      177247    136170.6      26300    2883600
    p2002m11 |     13,132    178649.3    137483.9      26500    2877400
    p2002m12 |     13,132    180062.9    138681.3      26700    2850700
    p2003m01 |     13,132    181461.5    139826.5      27300    2824900
    p2003m02 |     13,196    182714.4      140776      27300    2820800
-------------+---------------------------------------------------------
    p2003m03 |     13,196    184044.4    141992.5      26700    2837600
    p2003m04 |     13,196    185360.1    143185.4      26500    2843800
    p2003m05 |     13,196      186660    144234.3      26800    2845400
    p2003m06 |     13,196    187960.2    145200.2      26700    2854700
    p2003m07 |     13,196    189289.8    146191.1      26500    2868800
-------------+---------------------------------------------------------
    p2003m08 |     13,226    190560.9    147245.9      26500    2883700
    p2003m09 |     13,262    191939.8    148471.7      26800    2931000
    p2003m10 |     13,262    193518.7    150130.6      26700    2991300
    p2003m11 |     13,262      195230    152054.7      26600    3043900
    p2003m12 |     13,262    196990.2    154161.8      26400    3091300
-------------+---------------------------------------------------------
    p2004m01 |     13,263    198768.6    156331.6      26200    3139700
    p2004m02 |     13,337      200392    158351.5      26400    3185100
    p2004m03 |     13,361      202187    160567.7      27000    3221500
    p2004m04 |     13,362    204381.9    163349.5      27500    3266200
    p2004m05 |     13,364    206826.9    166554.6      27600    3328200
-------------+---------------------------------------------------------
    p2004m06 |     13,364    209223.9    169348.5      27600    3371700
    p2004m07 |     13,365    211685.6    172072.6      27500    3414000
    p2004m08 |     13,425    214046.7    174456.1      27200    3473500
    p2004m09 |     13,425    216401.9    176820.8      27400    3534900
    p2004m10 |     13,435    219131.7      180104      27900    3561300
-------------+---------------------------------------------------------
    p2004m11 |     13,436    221284.8    181939.2      28200    3573500
    p2004m12 |     13,436    223446.4    183798.8      28300    3591600
    p2005m01 |     13,436    225665.6    185870.8      28400    3645000
    p2005m02 |     13,478    227795.7    188022.8      28600    3707900
    p2005m03 |     13,497    230072.8    190188.3      29000    3744800
-------------+---------------------------------------------------------
    p2005m04 |     13,497      232487    192426.6      29300    3748900
    p2005m05 |     13,497    234869.4    194559.2      29200    3733600
    p2005m06 |     13,497    237230.1    196626.8      29100    3715900
    p2005m07 |     13,497    239556.4    198733.5      29500    3744900
    p2005m08 |     13,536    241548.7    200969.3      30100    3790800
-------------+---------------------------------------------------------
    p2005m09 |     13,536    243597.1      202818      30400    3802400
    p2005m10 |     13,538    245534.5    204526.6      30700    3798400
    p2005m11 |     13,538    247342.5    206095.2      31400    3825800
    p2005m12 |     13,538    248887.2    207393.4      32300    3860000
    p2006m01 |     13,540    250124.3    208368.7      32600    3870100
-------------+---------------------------------------------------------
    p2006m02 |     13,604    250660.4    208788.9      32200    3838600
    p2006m03 |     13,604    251557.4    209288.5      32200    3810700
    p2006m04 |     13,604    252393.4    209898.8      32500    3812500
    p2006m05 |     13,604    253055.4    210420.5      32600    3814900
    p2006m06 |     13,604    253491.3    210568.6      32700    3805800
-------------+---------------------------------------------------------
    p2006m07 |     13,604    253705.9    210409.9      33200    3794700
    p2006m08 |     13,630    253591.5    210021.4      33300    3793100
    p2006m09 |     13,630    253479.3    209687.8      33000    3793400
    p2006m10 |     13,630    253261.6    209255.6      32900    3799900
    p2006m11 |     13,630    252952.1    208744.2      33200    3797400
-------------+---------------------------------------------------------
    p2006m12 |     13,630      252585    208217.6      33200    3780200
    p2007m01 |     13,631      252360    207874.6      33100    3753700
    p2007m02 |     13,654      252151    207639.8      32800    3751100
    p2007m03 |     13,654    252010.4    207521.9      32300    3757700
    p2007m04 |     13,654    251780.7    207302.9      32200    3761700
-------------+---------------------------------------------------------
    p2007m05 |     13,654    251471.2    207005.5      32400    3775100
    p2007m06 |     13,654    250961.3    206574.1      32300    3800900
    p2007m07 |     13,654    250272.8    205937.3      32000    3797400
    p2007m08 |     13,689    249160.5    205027.8      32300    3775300
    p2007m09 |     13,690    248233.1    204240.8      32900    3753900
-------------+---------------------------------------------------------
    p2007m10 |     13,690    247214.7    203458.3      32600    3720000
    p2007m11 |     13,691    246099.2    202505.9      32500    3676200
    p2007m12 |     13,691      244760    201303.9      32900    3636600
    p2008m01 |     13,691    243246.8    199970.3      32900    3599600
    p2008m02 |     13,713    241397.5    198471.7      33000    3569600
-------------+---------------------------------------------------------
    p2008m03 |     13,725    239370.9    196553.8      33000    3554700
    p2008m04 |     13,725    237400.2    194648.4      32500    3541500
    p2008m05 |     13,725    235515.7    192960.3      32000    3532800
    p2008m06 |     13,725    233615.7    191379.1      32100    3522300
    p2008m07 |     13,725      231758    189688.3      32300    3487500
-------------+---------------------------------------------------------
    p2008m08 |     13,818      229449      187517      32600    3432500
    p2008m09 |     13,818    227944.5    185872.2      32800    3380800
    p2008m10 |     13,818    226571.7    184438.9      32800    3340500
    p2008m11 |     13,818    225283.1    183097.8      32700    3303000
    p2008m12 |     13,818    224076.6    181856.8      32700    3257300
-------------+---------------------------------------------------------
    p2009m01 |     13,818    223017.1    180822.2      32800    3210700
    p2009m02 |     13,828    221900.7    179708.1      32000    3164400
    p2009m03 |     13,828    220570.6    178265.6      31300    3114200
    p2009m04 |     13,828    218932.7      176481      30700    3065300
    p2009m05 |     13,828    217093.8    174508.6      30000    3014800
-------------+---------------------------------------------------------
    p2009m06 |     13,867    215110.3    172635.9      29600    2978800
    p2009m07 |     13,867    213768.6    171552.7      29200    2975100
    p2009m08 |     13,869    212767.4    170889.7      29400    2991700
    p2009m09 |     13,871    211918.2    170286.8      29400    3003600
    p2009m10 |     13,871    211187.6    169782.3      30100    3025600
-------------+---------------------------------------------------------
    p2009m11 |     13,871    210611.4    169478.2      31200    3036900
    p2009m12 |     13,880    209815.8    168883.8      30800    3087900
    p2010m01 |     13,889    208803.1      168194      29400    3153100
    p2010m02 |     13,915    207848.4    167571.9      29300    3173900
    p2010m03 |     14,148    205825.4    166392.6      30200    3153400
-------------+---------------------------------------------------------
    p2010m04 |     14,159    205265.1    166141.4      30500    3134600
    p2010m05 |     14,164    205180.3    167913.7      30500    3114300
    p2010m06 |     14,203    204579.7    167701.2      30900    3112800
    p2010m07 |     14,211    203754.3    167310.2      31200    3132000
    p2010m08 |     14,970    200140.3    165195.9      30300    3140900
-------------+---------------------------------------------------------
    p2010m09 |     14,973    199221.9    164755.8      30200    3125900
    p2010m10 |     14,975    198283.2    164188.6      30300    3097000
    p2010m11 |     14,976    197491.6    163877.9      29500    3089800
    p2010m12 |     14,977      196746    163734.1      29800    3110800
    p2011m01 |     14,981    196011.9    163564.3      29600    3154400
-------------+---------------------------------------------------------
    p2011m02 |     15,020    195142.6    163078.6      29400    3198000
    p2011m03 |     15,020    194438.6    162761.9      29100    3197100
    p2011m04 |     15,020      193721      162515      28900    3168700
    p2011m05 |     15,020    193074.7    162310.6      28500    3152100
    p2011m06 |     15,022      192526    162135.7      27900    3136900
-------------+---------------------------------------------------------
    p2011m07 |     15,024    191930.6    161866.3      27700    3108900
    p2011m08 |     15,074    191077.4    161260.6      28400    3093500
    p2011m09 |     15,074    190469.4    160895.5      29200    3121900
    p2011m10 |     15,074    189921.2    160684.2      29700    3168300
    p2011m11 |     15,074    189471.2    160549.6      29700    3202300
-------------+---------------------------------------------------------
    p2011m12 |     15,074    189161.5    160352.8      29800    3216200
    p2012m01 |     15,082    188941.8    160163.1      30200    3222200
    p2012m02 |     15,119    188754.1      160194      30700    3253000
    p2012m03 |     15,119    188953.4    160814.9      30900    3336600
    p2012m04 |     15,119    189286.9    161680.9      30800    3445300
-------------+---------------------------------------------------------
    p2012m05 |     15,119    189684.9      162795      30600    3571100
    p2012m06 |     15,120    190213.6    164086.5      30300    3685700
    p2012m07 |     15,120    190922.8    165450.6      29900    3761400
    p2012m08 |     15,163    191616.2    166677.1      29300    3800600
    p2012m09 |     15,163      192293      167937      28800    3839000
-------------+---------------------------------------------------------
    p2012m10 |     15,163      193000    169203.8      28500    3879600
    p2012m11 |     15,163    193829.4    170638.4      28000    3938300
    p2012m12 |     15,163      194725    172077.2      27400    3957000
    p2013m01 |     15,168    195590.8    173541.2      26800    3946800
    p2013m02 |     15,195    196489.9    175220.2      26400    3944500
-------------+---------------------------------------------------------
    p2013m03 |     15,195    197677.1    177250.4      26400    3987600
    p2013m04 |     15,195    199058.7    179455.3      26800    4026100
    p2013m05 |     15,195    200535.9    181743.8      26800    4038700
    p2013m06 |     15,195    202046.4    184077.1      26600    4049400
    p2013m07 |     15,196    203492.7    186195.5      26400    4057500
-------------+---------------------------------------------------------
    p2013m08 |     15,258    204494.4    187573.1      26400    4044900
    p2013m09 |     15,258    205583.1    188832.8      26300    4021100
    p2013m10 |     15,258      206489    189881.2      26300    3998500
    p2013m11 |     15,258    207258.6    190998.6      26900    3994800
    p2013m12 |     15,258      208003    192240.8      27300    4026300
-------------+---------------------------------------------------------
    p2014m01 |     15,262    208802.1    193539.4      27400    4055000
    p2014m02 |     15,326    209432.3    194691.6      27700    4069400
    p2014m03 |     15,326    210320.7    196046.2      28500    4095000
    p2014m04 |     15,326    211232.6    197392.3      28900    4133600
    p2014m05 |     15,327      212145    198736.7      29100    4165200
-------------+---------------------------------------------------------
    p2014m06 |     15,327    213076.6    200233.5      29300    4190200
    p2014m07 |     15,327    213978.7    201763.6      29300    4234200
    p2014m08 |     15,327    214828.6      203300      29600    4302400
    p2014m09 |     15,327    215570.1      204899      29700    4406200
    p2014m10 |     15,327    216264.6    206412.8      29700    4509800
-------------+---------------------------------------------------------
    p2014m11 |     15,327    216927.7    207437.6      29800    4563900
    p2014m12 |     15,327    217585.9    208242.1      29900    4568400
    p2015m01 |     15,327    218336.9    209485.4      29800    4601700
    p2015m02 |     15,327    219363.6    211553.5      29700    4726300
    p2015m03 |     15,327    220581.8    213835.2      29400    4894700
-------------+---------------------------------------------------------
    p2015m04 |     15,327    221854.6    215813.3      29300    5047900
    p2015m05 |     15,327    223100.7    217580.3      29400    5179800
    p2015m06 |     15,327    224312.2    219274.7      29800    5288200
    p2015m07 |     15,327    225481.2    220908.6      30000    5375200
    p2015m08 |     15,327    226609.9    222536.3      29900    5455800
-------------+---------------------------------------------------------
    p2015m09 |     15,327    227626.3    223769.9      29900    5484300
    p2015m10 |     15,327    228552.9    224562.4      29200    5506300
    p2015m11 |     15,327    229441.2    225178.3      28600    5567300
    p2015m12 |     15,327    230335.2      225942      28200    5618800
    p2016m01 |     15,327    231287.6    227181.1      28200    5668100
-------------+---------------------------------------------------------
    p2016m02 |     15,327    232336.3    228741.9      28700    5764000
    p2016m03 |     15,327    233493.7    230270.3      29300    5855200
    p2016m04 |     15,327    234679.3    231378.4      30000    5878700
    p2016m05 |     15,327    235711.9    231913.6      30600    5852700
    p2016m06 |     15,327      236520    231505.2      30600    5862100
-------------+---------------------------------------------------------
    p2016m07 |     15,327    237308.6    231200.3      30700    5934100
    p2016m08 |     15,327    238336.9    232013.8      30600    6045900
    p2016m09 |     15,327    239663.7      233927      30400    6164100
    p2016m10 |     15,327    241128.3    235898.2      30800    6225000
    p2016m11 |     15,327    242657.1    237780.9      31500    6188300
-------------+---------------------------------------------------------
    p2016m12 |     15,327      244082    239366.3      31800    6172200
    p2017m01 |     15,327    245340.2    240444.9      32100    6224700
    p2017m02 |     15,327    246487.2      240985      31200    6222300
    p2017m03 |     15,327    247607.9    241554.5      30400    6172200
    p2017m04 |     15,327    248776.2    242781.7      29700    6235200
-------------+---------------------------------------------------------
    p2017m05 |     15,327      249956    244317.1      29500    6370200
    p2017m06 |     15,327    250937.1    245546.2      29700    6428400
    p2017m07 |     15,327    251737.2    246457.3      30200    6436600
    p2017m08 |     15,327    252718.2    247509.5      30900    6495300
    p2017m09 |     15,327    253995.9    248719.8      31200    6533100
-------------+---------------------------------------------------------
    p2017m10 |     15,327    255461.6    251434.5      31100    6679200
    p2017m11 |     15,327    256878.8    255358.9      30900    6983800
    p2017m12 |     15,327    258173.4    258657.4      31200    7290200
    p2018m01 |     15,327    259178.7    260257.1      31700    7429700




(note: file ../temp/zillow_prices.dta not found)
file ../temp/zillow_prices.dta saved
(6 vars, 33,144 obs)
zcta5ce10: all characters numeric; regionname generated as long

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            15,311  
    -----------------------------------------
file G:/My Drive/research projects/wind/stata/zillow_zip.csv saved
(74 vars, 47,761 obs)
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
(3 observations deleted)
(28 observations deleted)
(1,800 observations deleted)
(41,824 observations deleted)
(data already sorted by regionname dt)
  variable dt was float now int
  variable new_turbines_zip_month was float now int
  variable aggr_turb_zip_month was float now int
  (24,636 bytes saved)
==================================================================================================
File: ../temp/turbines_zip.dta
Key: regionname dt
==================================================================================================
  4106:4(35710):3577933542:1524925683

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |      4,106    63723.82    22279.43        718      99771
          dt |      4,106    621.1128     46.0183        465        697
new_turbin~h |      4,106    10.47004    11.90321          1        129
aggr_turb_~h |      4,106    49.30346    72.79191          1        848




(note: file ../temp/turbines_zip.dta not found)
file ../temp/turbines_zip.dta saved
(note: j = 1996m04 1996m05 1996m06 1996m07 1996m08 1996m09 1996m10 1996m11 1996m12 1997m01 1997m02 1997m03 1997m04 1997m05 1997m06 1997m07 1997m08 1997m09 1997m10 1997m11 1997m12 1998m01 1998m02 1998m03 1998m04 1998m05 1998m06 1998m07 1998m08 1998m09 1998
> m10 1998m11 1998m12 1999m01 1999m02 1999m03 1999m04 1999m05 1999m06 1999m07 1999m08 1999m09 1999m10 1999m11 1999m12 2000m01 2000m02 2000m03 2000m04 2000m05 2000m06 2000m07 2000m08 2000m09 2000m10 2000m11 2000m12 2001m01 2001m02 2001m03 2001m04 2001m05 2
> 001m06 2001m07 2001m08 2001m09 2001m10 2001m11 2001m12 2002m01 2002m02 2002m03 2002m04 2002m05 2002m06 2002m07 2002m08 2002m09 2002m10 2002m11 2002m12 2003m01 2003m02 2003m03 2003m04 2003m05 2003m06 2003m07 2003m08 2003m09 2003m10 2003m11 2003m12 2004m0
> 1 2004m02 2004m03 2004m04 2004m05 2004m06 2004m07 2004m08 2004m09 2004m10 2004m11 2004m12 2005m01 2005m02 2005m03 2005m04 2005m05 2005m06 2005m07 2005m08 2005m09 2005m10 2005m11 2005m12 2006m01 2006m02 2006m03 2006m04 2006m05 2006m06 2006m07 2006m08 200
> 6m09 2006m10 2006m11 2006m12 2007m01 2007m02 2007m03 2007m04 2007m05 2007m06 2007m07 2007m08 2007m09 2007m10 2007m11 2007m12 2008m01 2008m02 2008m03 2008m04 2008m05 2008m06 2008m07 2008m08 2008m09 2008m10 2008m11 2008m12 2009m01 2009m02 2009m03 2009m04 
> 2009m05 2009m06 2009m07 2009m08 2009m09 2009m10 2009m11 2009m12 2010m01 2010m02 2010m03 2010m04 2010m05 2010m06 2010m07 2010m08 2010m09 2010m10 2010m11 2010m12 2011m01 2011m02 2011m03 2011m04 2011m05 2011m06 2011m07 2011m08 2011m09 2011m10 2011m11 2011m
> 12 2012m01 2012m02 2012m03 2012m04 2012m05 2012m06 2012m07 2012m08 2012m09 2012m10 2012m11 2012m12 2013m01 2013m02 2013m03 2013m04 2013m05 2013m06 2013m07 2013m08 2013m09 2013m10 2013m11 2013m12 2014m01 2014m02 2014m03 2014m04 2014m05 2014m06 2014m07 20
> 14m08 2014m09 2014m10 2014m11 2014m12 2015m01 2015m02 2015m03 2015m04 2015m05 2015m06 2015m07 2015m08 2015m09 2015m10 2015m11 2015m12 2016m01 2016m02 2016m03 2016m04 2016m05 2016m06 2016m07 2016m08 2016m09 2016m10 2016m11 2016m12 2017m01 2017m02 2017m03
>  2017m04 2017m05 2017m06 2017m07 2017m08 2017m09 2017m10 2017m11 2017m12 2018m01)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    15327   -> 4.0e+06
Number of variables                 269   ->       9
j variable (262 values)                   ->   date
xij variables:
         p1996m04 p1996m05 ... p2018m01   ->   p
-----------------------------------------------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                     4,014,461
        from master                 4,014,461  (_merge==1)
        from using                          0  (_merge==2)

    matched                             1,213  (_merge==3)
    -----------------------------------------
(4,014,461 missing values generated)
aggr_turb_zip_month:  (24,467 real changes made)
wind_farm:  (24,467 real changes made)
(4,014,461 real changes made)
(3,989,994 real changes made)
(3,989,994 real changes made)
(note: variable regionname was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         3,689,222  
    -----------------------------------------

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                         3,642,848  
    -----------------------------------------
       panel variable:  regionname (strongly balanced)
        time variable:  dt, 1996m4 to 2018m1
                delta:  1 month
(data already sorted by regionname dt)
  variable dt was float now int
  variable new_turbines_zip_month was int now byte
  variable wind_farm was float now byte
  variable regionname was double now long
  (36,428,480 bytes saved)
==================================================================================================
File: G:/My Drive/research projects/wind/stata/wind_prices_turbines.dta
Key: regionname dt
==================================================================================================
  3642848:28(27929):3910826115:3479291563

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  regionname |  3,642,848    45568.73    28529.68       1001      99362
          dt |  3,642,848       565.5    75.63234        435        696
        date |          0
    regionid |  3,642,848     79635.3    29131.85      58196     417467
        city |          0
-------------+---------------------------------------------------------
       state |          0
       metro |          0
  countyname |          0
    sizerank |  3,642,848    7850.666    4402.828          1      15322
           p |  3,282,557    189358.3      168743      16700    7429700
-------------+---------------------------------------------------------
new_turbin~h |  3,642,848       .0032    .2650905          0         86
aggr_turb_~h |  3,642,848    .2296824    5.025583          0        387
   wind_farm |  3,642,848    .0068252    .0823321          0          1
   zcta5ce10 |  3,642,848    45568.73    28529.68       1001      99362
    area_zip |  3,642,848    182.1135    363.6473     .18995    10150.9
-------------+---------------------------------------------------------
tot_w_wind~p |  3,642,848    62.54683    226.0068          0   7824.251
wind_zip_a~o |  3,642,848    21.39369      28.877          0   99.83378
     zipcode |  3,642,848    45568.73    28529.68       1001      99362
     returns |  3,642,848    7262.969    6852.615   116.0004      48032
adj_gr_inc~e |  3,642,848    431950.8    508627.8       4639    9043505
-------------+---------------------------------------------------------
  avg_income |  3,642,848    58.20166    38.28365   17.00462   984.9697
  male_ratio |  3,642,848    .4943549      .02324   .2033244   .8176447
         pop |  3,642,848    16116.22    15097.62        172     111086
 white_ratio |  3,642,848     .815966    .1949962    .004805   .9978271
 black_ratio |  3,642,848    .0893126    .1595814          0   .9805999
-------------+---------------------------------------------------------
 asian_ratio |  3,642,848    .0276197    .0555506          0   .7044285
   elevation |  3,642,848    280.8244    376.2418        -37       3630
   near_dist |  3,642,848    212.7294    265.0383   .0020966   1316.173




file G:/My Drive/research projects/wind/stata/wind_prices_turbines.dta saved

. 
end of do-file

 make.py ended: 2018-03-12 11:46:56
